[
    {
        "stem": "In Requirements Engineering, the activity that seeks to identify and document the needs of the user and the client is known as:",
        "options": [
            "Requirements check.",
            "Viability analysis.",
            "Request of requirements.",
            "Requirements Validation.",
            "Architecture project."
        ],
        "correctOption": 2,
        "explanation": "The Request of Requirements is the activity of discovering the needs and information of customers and users, being the first phase of the Requirements Engineering."
    },
    {
        "stem": "What is the main difference between Customer Requirements (User) and System Requirements?",
        "options": [
            "Customer requirements are technical, and System requirements are business.",
            "Customer requirements are descriptions in natural language of what the system should do; System requirements are detailed and describe operational functions and restrictions.",
            "System Requirements specify only features, and Customers specify performance.",
            "Customer requirements are used for acceptance tests, and System requirements are used for coding.",
            "There's no difference, just different levels of detail."
        ],
        "correctOption": 1,
        "explanation": "Customer/User requirements are statements in natural language, focused on what the user wants. System requirements are detailed, technical and describe the system functions and operational restrictions."
    },
    {
        "stem": "A requirement that 'The time to respond to the company's active debt should not exceed 13 ms in normal processing situations' is an example of what type of requirement?",
        "options": [
            "Functional Request.",
            "Interface request.",
            "Security requirement.",
            "Non-Functional Request.",
            "Domain Request."
        ],
        "correctOption": 3,
        "explanation": "This is a Non-Functional Request (Restriction) that deals with service quality, specifically performance (response time)."
    },
    {
        "stem": "Which specification technique is most commonly associated with agile methodologies such as Scrum?",
        "options": [
            "Data Flow Diagram (DFD).",
            "Entity-Relationship Model (ER).",
            "Use Cases (UML).",
            "User Stories (User Stories).",
            "Traceability matrix."
        ],
        "correctOption": 3,
        "explanation": "User Stories (User Stories) are the most common specification technique in agile methodologies, focusing on the value to be delivered to the user, in the format 'As <paper>, I want <objective>, so that <reason>'."
    },
    {
        "stem": "Which of the following alternatives presents a possible Functional Requirement for an e-commerce system?",
        "options": [
            "The system should be available 99.9% of the time.",
            "The system must calculate the total purchase value by applying discounts and freight.",
            "The system must be compatible with Chrome and Firefox browsers.",
            "The page loading time shall not exceed 2 seconds.",
            "The system must encrypt credit card data."
        ],
        "correctOption": 1,
        "explanation": "Functional Requirement defines a function or service that the system must perform, such as 'calculating the total purchase value'."
    },
    {
        "stem": "The verification of requirements shall have the role of ensuring that:",
        "options": [
            "The final system meets customer needs (Validation).",
            "They are correctly described, consistent and complete (Verification).",
            "Safety requirements are the first to be implemented.",
            "Traceability is performed only after acceptance tests.",
            "They are turned into source code directly."
        ],
        "correctOption": 1,
        "explanation": "The Requirements Check ensures that the requirements are correct, complete and consistent, focusing on the quality of the documentation."
    },
    {
        "stem": "In relation to the Requirements Traceability Matrix (MRR), what alternative correctly represents its meaning?",
        "options": [
            "It is a tool to manage costs associated with project requirements.",
            "It is a technique to prioritize requirements based on their importance.",
            "It is a structure to track the relationship between requirements, from their origin to their implementation and testing.",
            "It is a methodology to identify inconsistencies between non-functional requirements.",
            "It's a model for designing software architecture."
        ],
        "correctOption": 2,
        "explanation": "The Requirements Trackability Matrix (MRR) is a tool to track the connection and relationship between the requirements and other project artifacts (such as tests and code modules)."
    },
    {
        "stem": "What is the stage of Requirements Engineering where conflicts between requirements are resolved and what is essential (priorization)?",
        "options": [
            "Exciting.",
            "Validation.",
            "Elaboration.",
            "Conception.",
            "Negotiation."
        ],
        "correctOption": 4,
        "explanation": "Negotiation is the stage where conflicts are resolved and stakeholders agree with a set of priority requirements, defining the final scope."
    },
    {
        "stem": "What is the technique of eliciting requirements in which the requirements engineer accompanies the user in his work environment to understand the flow of tasks, even if this may alter the normal behavior of the user (Hawthorne Effect)?",
        "options": [
            "JAD (Joint Application Development) meeting.",
            "Field Observation (Ethnography).",
            "Brainstorming.",
            "Structured Interviews.",
            "Rapid Prototyping."
        ],
        "correctOption": 1,
        "explanation": "Field Observation or Ethnography is the technique where the analyst accompanies users to observe the system in use and understand the operational context."
    },
    {
        "stem": "The acronym FURPS+ (Functionality, Usability, Reliability, Performance, Supportability) is commonly used to classify what type of requirement?",
        "options": [
            "Customer Requirements.",
            "Legal requirements.",
            "Functional requirements.",
            "Interface requirements.",
            "Requirements Not Working."
        ],
        "correctOption": 4,
        "explanation": "FURPS+ is a model that categorizes and details the Non-Functional Requirements, providing a complete structure for system qualities."
    },
    {
        "stem": "Which of the following requirements is an example of Non-Functional Request of the category 'Usability'?",
        "options": [
            "The system must allow login with username and password.",
            "The system should have a maximum of 1 hour unavailability per month.",
            "The system must be implemented in Python language.",
            "The system should be intuitive, with a learning curve less than 30 minutes for new users.",
            "The system must issue electronic invoice."
        ],
        "correctOption": 3,
        "explanation": "Usability requirements describe the ease of use of the system, such as the learning curve or the intuitiveness of the interface."
    },
    {
        "stem": "In the context of Requirements Engineering, what does the term 'Validation' mean?",
        "options": [
            "Ensure that the requirements are technically feasible.",
            "Ensure that the system is being developed correctly (Verification).",
            "Ensure that the system meets the real needs and wishes of the customer.",
            "Ensure that the documentation is complete and unambiguous.",
            "Ensure that the project will be delivered on time and budget."
        ],
        "correctOption": 2,
        "explanation": "The Requirements Validation ('Are we building the right system?') ensures that the built system meets the needs of *stakeholders*."
    },
    {
        "stem": "Which of the following elements should be included in a Requirements Document (IEEE/ANSI 830-1998)?",
        "options": [
            "The complete system source code.",
            "The team's development schedule.",
            "A Glossary that defines technical terms and abbreviations.",
            "The list of all unit tests.",
            "The structure of the final database."
        ],
        "correctOption": 2,
        "explanation": "The IEEE 830-1998 standard requires the requirement document to include Definitions, Acronyms and Abbreviations (Glossary) to ensure uniformity of language."
    },
    {
        "stem": "One of the main factors that lead to rework and failures in software projects is ambiguity in requirements, which can be caused by:",
        "options": [
            "Overuse of UML diagrams.",
            "Inconsistent terminology and use of complex conditional clauses.",
            "Full and detailed documentation.",
            "High user participation in the process.",
            "Adoption of agile methodologies."
        ],
        "correctOption": 1,
        "explanation": "Common problems in the writing of requirements include the use of complex conditional clauses (which confuse) and inconsistent terminology (which generates different interpretations)."
    },
    {
        "stem": "The requirement allocation activity to subsystems (hardware or software) in a broader process of System Engineering is called:",
        "options": [
            "Systems Integration.",
            "Architecture project.",
            "Requirements Partition.",
            "Subsystem Development.",
            "System validation."
        ],
        "correctOption": 2,
        "explanation": "The Partition of Requirements (or Allocation) is the process of decomposing the system and allocating the requirements to the subsystems that will compose it (hardware, software, etc.)."
    },
    {
        "stem": "What is the primary target audience of the Customer Requirements documentation (User)?",
        "options": [
            "Test engineers and programmers.",
            "Project managers and software architects.",
            "System customers, end users and management.",
            "Maintenance engineers and *devops*.",
            "Only the systems analyst."
        ],
        "correctOption": 2,
        "explanation": "Customer requirements are written in natural language to be understood by the various stakeholders (stakeholders), mainly customers and users."
    },
    {
        "stem": "Which of the alternatives is an example of Non-Functional Request of the category 'Performance'?",
        "options": [
            "The system should be able to register new users.",
            "The system must operate in a Linux environment.",
            "The system shall support at least 20 transactions per second.",
            "The system shall conform to ISO 9001.",
            "The system must have an exit button."
        ],
        "correctOption": 2,
        "explanation": "Performance Requirements (Performance) are non-functional requirements that define metrics such as response time, transfer rate or transaction capacity per second."
    },
    {
        "stem": "What is a Domain Requirement?",
        "options": [
            "System security-related request.",
            "Request that defines what the system should do.",
            "Request that emerges from the application, restricting functionality and operation, based on the knowledge of the problem (the 'domain').",
            "Request that limits the number of simultaneous users.",
            "Request that is defined by the project manager."
        ],
        "correctOption": 2,
        "explanation": "Domain Requirements are those that come from the knowledge of the application area of the system, restricting the system according to the rules or characteristics of the business."
    },
    {
        "stem": "The Traceability Matrix is essentially important for which requirement management activity?",
        "options": [
            "Code generation.",
            "Cost analysis and project risks.",
            "Software version control.",
            "Conduct impact analysis when there are changes in requirements.",
            "Documentation of non-functional requirements."
        ],
        "correctOption": 3,
        "explanation": "The tracking of requirements (MRR) is of great importance to conduct impact analysis when there are changes, allowing to identify which artifacts will be affected."
    },
    {
        "stem": "What is Requirements Partition?",
        "options": [
            "The division of functional requirements from non-functional.",
            "The allocation of requirements to different subsystems (hardware, software, operational).",
            "The disposal of low priority requirements.",
            "The verification of the consistency of the requirements.",
            "The initial design phase of the system."
        ],
        "correctOption": 1,
        "explanation": "The Partition of Requirements is the activity where the requirements are allocated or distributed to the different components (subsystems) of the system as a whole."
    },
    {
        "stem": "What is the main disadvantage of using the 'Quick Prototyping' technique in eliciting requirements?",
        "options": [
            "It generates excessive documentation.",
            "It can lead stakeholders to focus on graphical interface details, ignoring performance or security.",
            "It's too slow and expensive.",
            "It is useful only for non-functional requirements.",
            "It does not allow user participation."
        ],
        "correctOption": 1,
        "explanation": "A common disadvantage of prototyping is that users can focus too much on appearance and superficial aspects of the interface, losing focus on business rules and non-functional requirements."
    },
    {
        "stem": "Which of the following elements is considered an 'Emergent Property' of a software system?",
        "options": [
            "User login.",
            "Tax calculation.",
            "Reliability.",
            "Reporting.",
            "Data log."
        ],
        "correctOption": 2,
        "explanation": "Properties Emerging are system properties as a whole that arise from the integration of subsystems. Examples include Reliability, Performance and Usability."
    },
    {
        "stem": "The validation of requirements is ideally performed at what time of the project life cycle?",
        "options": [
            "Only after final delivery of the system.",
            "Only after the coding phase.",
            "At the beginning of the project, as the first activity.",
            "At all stages of the project, continuously.",
            "Only in negotiation, before development."
        ],
        "correctOption": 3,
        "explanation": "The validation (and verification) of requirements should be a continuous process carried out at all stages of the project to ensure that the system meets the needs of the customer."
    },
    {
        "stem": "Which of the following is an example of 'Organizational Requirement'?",
        "options": [
            "The system must use the PostgreSQL database.",
            "The system shall be compatible with mobile devices.",
            "The system must have a GUI that follows the Windows interface pattern.",
            "The system aims to increase the company's profits by 10% in the first year.",
            "The system should allow password change every 30 days."
        ],
        "correctOption": 3,
        "explanation": "Organizational requirements concern company goals, strategic policies, or business objectives, such as increasing profits or following corporate standards."
    },
    {
        "stem": "What is the main disadvantage of having 'Undocumented Assumptions' in a requirement document?",
        "options": [
            "They lead to a cleaner code.",
            "They are the main cause of rework, as they lead to conflicting expectations among stakeholders.",
            "They facilitate traceability.",
            "They simplify the testing phase.",
            "They ensure compliance with the IEEE standard."
        ],
        "correctOption": 1,
        "explanation": "Undocumented assumptions (30%) are listed as the main cause of rework, as each part assumes something different, leading to errors and high costs for further correction."
    },
    {
        "stem": "What does it mean to say that a requirement should be 'not ambiguous'?",
        "options": [
            "It must be possible to trace its origin to the client.",
            "It should be possible to verify the requirement by testing.",
            "It shall be interpreted in a single manner by all parties concerned.",
            "It must conform to the IEEE 830 standard.",
            "It should be the most important requirement for the success of the project."
        ],
        "correctOption": 2,
        "explanation": "A non-ambiguous requirement is one that has only one possible interpretation, avoiding misunderstandings between customers and developers."
    },
    {
        "stem": "In the context of 'X Cost Correction', which phase presents the lowest relative cost (value 1) for correcting an error?",
        "options": [
            "Design.",
            "Coding.",
            "Requirements.",
            "Development Testing.",
            "Operation."
        ],
        "correctOption": 2,
        "explanation": "The X Cost Correction chart shows that the relative cost for correcting an error in the Requirements phase is 1, with the lowest."
    },
    {
        "stem": "What is the main disadvantage of the interview technique for the elicitation of requirements?",
        "options": [
            "The generation of incomplete source code.",
            "The great difficulty of formal documentation.",
            "The risk of the user omitting relevant information or focusing on exceptions without describing the normal workflow.",
            "The high cost of prototyping.",
            "It is used only for non-functional requirements."
        ],
        "correctOption": 2,
        "explanation": "Interviews run the risk of being influenced by the analyst or the user, who may not be able to verbalize all the requirements or omit important information."
    },
    {
        "stem": "According to the IEEE/ANSI 830-1998 standard, which section of the Requirements Document should cover functional, non-functional and interface requirements?",
        "options": [
            "Introduction.",
            "General description.",
            "Specific requirements.",
            "Appendices.",
            "Glossary."
        ],
        "correctOption": 2,
        "explanation": "Section 3 of the standard, 'Specific Requirements', is where the functional, non-functional and interface requirements are detailed."
    },
    {
        "stem": "Which alternative is an example of Security Request?",
        "options": [
            "The system should be available 99.9% of the time.",
            "The system must be implemented using the Spring Boot framework.",
            "The system shall use SSL/TLS encryption in all sensitive data communications.",
            "The system should be easily tested by test engineers.",
            "The system must be accessible via WWW browser."
        ],
        "correctOption": 2,
        "explanation": "Safety requirements are non-functional requirements that define system protection, such as the use of encryption or access control."
    },
    {
        "stem": "What are the Emergent Properties of a system?",
        "options": [
            "Requirements that are defined at the coding stage.",
            "Requirements that are limited by budget issues.",
            "Properties that arise only when all subsystems are integrated and interconnected.",
            "Requirements describing basic system functionality.",
            "Requirements that are defined by the client, but are not critical."
        ],
        "correctOption": 2,
        "explanation": "Properties Emerging are system properties as a whole that only emerge when all subsystems are integrated (e.g. reliability, performance, security)."
    },
    {
        "stem": "One of the Top 3 success factors (Top 3 success factors) for software projects, according to Standish Group research, is:",
        "options": [
            "Use of advanced AI.",
            "Project manager experience.",
            "Clear statement of requirements.",
            "Low initial budget.",
            "Focus on non-functional requirements."
        ],
        "correctOption": 2,
        "explanation": "The Standish Group search lists 'Clear status of requirements' as one of the three main success factors."
    },
    {
        "stem": "What is the primary responsibility of the system test engineers in relation to the requirements document?",
        "options": [
            "Ensure the integrity of the source code.",
            "Use requirements to develop system validation tests.",
            "Define non-functional requirements.",
            "Ensure that the system architecture is scalable.",
            "Implement the user interface."
        ],
        "correctOption": 1,
        "explanation": "System Test Engineers use the requirements as a basis for developing system validation tests."
    },
    {
        "stem": "What kind of requirement concerns the company's goals, strategic policies or business objectives?",
        "options": [
            "Functional requirements.",
            "Non-Functional Requirements.",
            "Interface requirements.",
            "Organizational requirements.",
            "Domain requirements."
        ],
        "correctOption": 3,
        "explanation": "Organizational requirements concern the company's goals, strategic policies adopted and the entire structure of the organization."
    },
    {
        "stem": "Requirements Engineering is described as a discipline to develop a specification that serves as the basis for an agreement between all parties involved. This highlights the property of:",
        "options": [
            "No ambiguity and consistency.",
            "Ease of maintenance.",
            "Low cost of implementation.",
            "Simple encryption.",
            "Focus on software architecture."
        ],
        "correctOption": 0,
        "explanation": "The discipline seeks a 'complete, consistent and non-ambiguous' specification, and consistency and non-ambiguosity are key to the agreement."
    },
    {
        "stem": "Which one is 'Top 3 factors leading to failure' (Top 3 failure factors) in projects, according to Standish Group research?",
        "options": [
            "Lack of competent personnel.",
            "Requirements and incomplete specifications.",
            "Overfocus on the user interface.",
            "Use of agile methodologies.",
            "No project manager."
        ],
        "correctOption": 1,
        "explanation": "One of the main failure factors is 'Incomplete requirements & specs'."
    },
    {
        "stem": "What requirement defines the system's features, as 'The system should allow book purchases'?",
        "options": [
            "Non-Functional Request.",
            "Organizational request.",
            "Performance Request.",
            "Functional Request.",
            "Emerging Property."
        ],
        "correctOption": 3,
        "explanation": "Functional requirements define the functionalities or services that the system must provide."
    },
    {
        "stem": "What does the term 'Inconsistent' mean in relation to requirements?",
        "options": [
            "That the requirement cannot be traced to its origin.",
            "That the requirement is written vaguely and ambiguously.",
            "There are contradictions between different requirements or between the requirement and the system model.",
            "That the cost of implementation is too high.",
            "That the requirement was set by the developer."
        ],
        "correctOption": 2,
        "explanation": "Inconsistent requirements are those that have contradictions with each other or with the rules of the domain, which prevents clear implementation."
    },
    {
        "stem": "What is the main function of System Engineering in relation to Requirements Engineering?",
        "options": [
            "Encoding the software at a high level.",
            "Treat the system as a whole, including hardware, software and operational processes.",
            "Focus exclusively on functional requirements.",
            "Set database architecture.",
            "Guarantee the low cost of the project."
        ],
        "correctOption": 1,
        "explanation": "Systems Engineering treats the system as a whole, including hardware, software, and operational processes, while Software Requirements Engineering focuses specifically on the software component."
    },
    {
        "stem": "What's the meaning of the phrase 'the pencil only costs pennies... Can rubber cost millions' in the context of software development?",
        "options": [
            "The writing of requirements is the most expensive part.",
            "Encoding errors are more expensive than design errors.",
            "It is more expensive to fix requirements late (the rubber) than to spend time with the initial specification ('the pencil').",
            "The use of diagrams is unnecessary.",
            "The cost of the software is inversely proportional to the hardware cost."
        ],
        "correctOption": 2,
        "explanation": "The popular phrase reinforces the exponential cost of error correction (rework), encouraging accuracy in the initial stage of requirements."
    },
    {
        "stem": "In which section of the IEEE 830-1998 standard would be detailed the requirement 'The system should be implemented to be accessible via WWW (World-Wide-Web) browser'?",
        "options": [
            "1.1 Purpose of the Requirements document.",
            "2.3 User characteristics.",
            "3. Specific requirements (Interface/Non-Functional).",
            "4. Appendices.",
            "1.5 Summary of the rest of the document."
        ],
        "correctOption": 2,
        "explanation": "This is an interface and non-functional requirement that would be detailed in the 'Specific Requirements' section (Section 3)."
    },
    {
        "stem": "Which of the following activities is not part of the System Engineering process according to diagram V?",
        "options": [
            "Architecture project.",
            "Requirements Partition.",
            "Systems Integration.",
            "Source code creation of operating systems.",
            "System validation."
        ],
        "correctOption": 3,
        "explanation": "The System Engineering process focuses on the decomposition, development and integration of subsystems (hardware, software, etc.), but the creation of source code of operating systems is not explicitly one of its main activities in this context."
    },
    {
        "stem": "What are Domain Requirements?",
        "options": [
            "Requirements defining response time restrictions.",
            "Requirements describing the rules and characteristics of the business or application area.",
            "Requirements related to system compatibility with other systems.",
            "Requirements that are ignored during encoding.",
            "Requirements that are defined exclusively by the software engineer."
        ],
        "correctOption": 1,
        "explanation": "Domain requirements arise from the knowledge of the application domain and impose restrictions based on the rules and characteristics of this business."
    },
    {
        "stem": "Which of the following is one of the 'Requirements Problems' listed in the slides?",
        "options": [
            "The lack of a dedicated GPU.",
            "The requirements are inconsistent and/or incomplete.",
            "The low cost to make changes in requirements late.",
            "Easy to get the correct solution format.",
            "The excessive clarity of the requirements."
        ],
        "correctOption": 1,
        "explanation": "Problems listed include 'Requirements are inconsistent and/or incomplete'."
    },
    {
        "stem": "What should be included in the 'General Description' section of the Requirements Document (IEEE/ANSI 830-1998)?",
        "options": [
            "The purpose of the document.",
            "Definitions, acronyms and abbreviations.",
            "Product perspective, product functions and user characteristics.",
            "Functional and non-functional requirements.",
            "Reference index."
        ],
        "correctOption": 2,
        "explanation": "The 'General Description' section includes the Product Perspective, Product Functions, User Characteristics, General Limitations and Assumptions/dependencies."
    },
    {
        "stem": "At the beginning of computing, what was the typical approach to finding requirements, according to the motivation presented?",
        "options": [
            "Use of rapid prototyping.",
            "Implementation of JAD sessions.",
            "The programmers sat down and started coding, without formal proceedings.",
            "Complete documentation, not ambiguous.",
            "Total focus on non-functional requirements."
        ],
        "correctOption": 2,
        "explanation": "The 'Motivation' slide mentions that 'In the beginning of computing there was no process for discovering the requirements' and 'The programmers sat down and started coding'."
    },
    {
        "stem": "What does 'Maintainability Requirements' mean?",
        "options": [
            "Requirements defining the ease of use of the system.",
            "Requirements defining the ability of the system to be corrected, adapted and improved over time.",
            "Requirements specifying the number of simultaneous users.",
            "Requirements defining the software architecture.",
            "Requirements that deal with user training."
        ],
        "correctOption": 1,
        "explanation": "Maintenance (Maintainability) is an emerging property and a non-functional requirement that defines the ease with which the system can be changed or corrected."
    },
    {
        "stem": "What is the definition of 'Stakeholders of the system'?",
        "options": [
            "Just the project manager.",
            "Anyone affected in any way by the system.",
            "Only the developers and test engineers.",
            "People who have no knowledge of the domain.",
            "People who signed the requirements contract."
        ],
        "correctOption": 1,
        "explanation": "Stakeholders are 'Anyone affected somehow by the system' (FAQ)."
    },
    {
        "stem": "According to the graph, the requirement error can cost from 40 to 1000 times more to be corrected when detected at the stage of:",
        "options": [
            "Requirements.",
            "Design.",
            "Coding.",
            "Development Testing.",
            "Operation."
        ],
        "correctOption": 4,
        "explanation": "The X Cost Correction chart (and the supporting text) shows that the correction cost is exponential in the final phase, with Operation being the most expensive phase (40-1000 times or 100 times depending on the source)."
    },
    {
        "stem": "What is a portability requirement?",
        "options": [
            "Request that defines system performance.",
            "Request that defines the ease of transferring the software to different environments or platforms.",
            "Request that defines data export features.",
            "Request that you handle the reliability of the system.",
            "Request specifying the communication protocol."
        ],
        "correctOption": 1,
        "explanation": "Portability is a non-functional requirement that refers to the software's ability to operate on different platforms or hardware/software environments."
    },
    {
        "stem": "What is the definition of 'Organizational Requirements' according to slides?",
        "options": [
            "Requirements defining the software architecture.",
            "Requirements relating to company targets, strategic policies and employee objectives.",
            "Requirements dealing with system safety and performance.",
            "Requirements describing the functionality of the product.",
            "Requirements limiting the usability of the interface."
        ],
        "correctOption": 1,
        "explanation": "Organizational requirements concern the company's goals, strategic policies adopted and the company's employees with their respective objectives, in short, the entire structure of the organization[cite: 251, 252]."
    },
    {
        "stem": "What is the main disadvantage of Rapid Prototyping in requirements eliciting?",
        "options": [
            "The customer cannot view the final product.",
            "It can lead users to focus on graphical interface details, ignoring performance and security requirements.",
            "It is an expensive process that requires high initial investment.",
            "It generates an excessively detailed final documentation.",
            "It is useful only for functional requirements."
        ],
        "correctOption": 1,
        "explanation": "A common disadvantage of Rapid Prototyping is that users can focus too much on appearance and superficial aspects of the interface, losing focus on non-functional aspects (performance, security)."
    },
    {
        "stem": "Which of the following Emerging Properties is NOT mentioned in the material?",
        "options": [
            "Reliability.",
            "Maintenance.",
            "Portability.",
            "Performance.",
            "Usability."
        ],
        "correctOption": 2,
        "explanation": "The material lists Reliability, Maintenance, Performance, Usability and Safety as examples of emerging properties[cite: 366, 367, 368, 369, 370]."
    },
    {
        "stem": "What is the estimated cost of correction of a requirement error if it is detected and corrected in the Operation phase, in relation to the cost in the Requirements phase?",
        "options": [
            "Ten times more expensive.",
            "Three to six times more expensive.",
            "15 to 40 times more expensive.",
            "40 to 1000 times more expensive.",
            "About 27 times more expensive."
        ],
        "correctOption": 3,
        "explanation": "The X Cost Correction chart indicates that the relative cost in the Operation phase is 40 to 1000 (or 100 times more expensive, according to another source) than the cost 1 in the Requirements phase[cite: 159, 186]."
    },
    {
        "stem": "What is the main function of the Requirements Document?",
        "options": [
            "Serve as end-user system manual.",
            "Describe detailed architecture and system code.",
            "Be a formal document used to communicate requirements to customers, engineers and managers.",
            "List only functional and safety requirements.",
            "Set the schedule and total cost of the project."
        ],
        "correctOption": 2,
        "explanation": "The Requirements Document is a formal document used to communicate requirements to customers, engineers and managers[cite: 374]."
    },
    {
        "stem": "One of the problems of the listed requirements is 'The requirements do not reflect the real needs of the system customers'. What is the most likely factor that causes this problem?",
        "options": [
            "Use Python as a programming language.",
            "Lack of support from executive management.",
            "Late encryption.",
            "Inadequate or incomplete solicitation.",
            "Excess of non-functional requirements."
        ],
        "correctOption": 3,
        "explanation": "The direct cause of the requirements not reflecting the needs of the customer is failure to elicit or analyze the requirements."
    },
    {
        "stem": "In the System Engineering Process (Diagram V), what activity precedes the 'Subsystem Development'?",
        "options": [
            "Systems validation.",
            "Systems Integration.",
            "Software Requirements Engineering.",
            "Architecture project.",
            "System Requirements Engineering."
        ],
        "correctOption": 2,
        "explanation": "Diagram V (Slide 28) shows that the 'Software Requirements Engineering' feeds the 'Subsystem Development'[cite: 333, 331]."
    },
    {
        "stem": "What is the definition of 'Non-Functional Request' given by the material?",
        "options": [
            "Define system functionality.",
            "They concern development restrictions, performance aspects, user interfaces, reliability and security.",
            "Define the requirements the client does not need.",
            "They only concern the company's goals.",
            "Define the cost and time frame of the project."
        ],
        "correctOption": 1,
        "explanation": "Non-Functional requirements concern development constraints, performance aspects, user interfaces, reliability, safety, maintenance, portability, standards to be followed[cite: 245]."
    },
    {
        "stem": "What is the main consequence when requirements are wrong according to FAQs?",
        "options": [
            "The cost of requirements engineering increases to 50%.",
            "The system delays, remains unreliable and does not meet the needs of customers.",
            "There's an 82% encoding error.",
            "The design is adapted to the IEEE 830 standard.",
            "There is a change in the organizational structure."
        ],
        "correctOption": 1,
        "explanation": "When the requirements are wrong, 'The system delays, is unreliable and does not meet the needs of customers' [cite: 280]."
    },
    {
        "stem": "Which of the following sections DO NOT belong to the 'General Description' (Section 2) of the IEEE/ANSI 830-1998 standard?",
        "options": [
            "Product perspective.",
            "Product functions.",
            "Specific requirements.",
            "User characteristics.",
            "General limitations."
        ],
        "correctOption": 2,
        "explanation": "The 'General Description' section includes Product Perspective, Product Functions, User Characteristics, General Limitations. [ ]'Specific Requirements' is section 3[cite: 427, 428, 429, 430, 432]."
    },
    {
        "stem": "Who are System Customers and what is their function in relation to the Requirements Document?",
        "options": [
            "It's the programmers who implement the code.",
            "It's the managers who plan the development.",
            "It is the parties that specify the requirements and read them to see if they meet their needs.",
            "It's the maintenance engineers who use the document to understand the system.",
            "It's the test engineers who develop validation."
        ],
        "correctOption": 2,
        "explanation": "Customers of the System 'Specify the requirements and read them to check if they satisfy their needs'[cite: 395, 396]."
    },
    {
        "stem": "What does the Requirement activity establish?",
        "options": [
            "The structure of the organization.",
            "The decomposition of the system into subsystems.",
            "The allocation of requirements to the different subsystems.",
            "The cost of developing the system.",
            "The emerging properties of the system."
        ],
        "correctOption": 2,
        "explanation": "The Requirements Partition is the activity in which 'Requirements are allocated to these sub-systems'[cite: 343]."
    },
    {
        "stem": "Software Requirements Engineering plays a role in the System Engineering Process?",
        "options": [
            "Ensure System Validation.",
            "Derive more detailed software requirements for the system software.",
            "Set the system requirements as a whole.",
            "Integrate hardware and software subsystems.",
            "Set system architecture."
        ],
        "correctOption": 1,
        "explanation": "Software Requirements Engineering is the activity where 'most detailed software requirements are derived for the system software'[cite: 346]."
    },
    {
        "stem": "Which of the following is a recommended guideline for writing requirements?",
        "options": [
            "Use language in a complex and ambiguous way.",
            "Specify requirements in a quantitative manner.",
            "Assume that readers have knowledge of the domain.",
            "Restrict yourself only to natural language.",
            "Focus only on functional requirements."
        ],
        "correctOption": 1,
        "explanation": "A writing guideline is 'Specify requirements quantitatively'[cite: 521]."
    },
    {
        "stem": "What is the ideal relationship, but in impossible practice, between Requirements and Design?",
        "options": [
            "They should always be integrated, but in practice they are separated.",
            "They should be separated, but in practice they are interconnected.",
            "Requirements shall be defined after the design.",
            "Project must be defined after encoding.",
            "They should always be ambiguous."
        ],
        "correctOption": 1,
        "explanation": "The ideal relationship is that 'Requirements and design are interconnected. [ ]Ideally they should be separated, but in practice this is impossible' [cite: 292]."
    },
    {
        "stem": "In the XYZ company standard, which chapter defines all technical terms and abbreviations used in the document?",
        "options": [
            "Preface.",
            "Introduction.",
            "Glossary.",
            "General user requirements.",
            "System architecture."
        ],
        "correctOption": 2,
        "explanation": "In the XYZ company standard, Glossary defines 'all technical terms and abbreviations used in the document'[cite: 452]."
    },
    {
        "stem": "Why is the Undocumented Assumptions error the biggest cause of rework?",
        "options": [
            "The error is related to the encoding failure.",
            "The error is related to lack of executive support.",
            "It causes different conflicting interpretations and expectations, leading to costly changes.",
            "It occurs due to excessive use of diagrams.",
            "It's a system portability problem."
        ],
        "correctOption": 2,
        "explanation": "Undocumented Assumptions (30%) are the main cause of rework, as they lead to inconsistencies and misunderstandings between the parties."
    },
    {
        "stem": "What do System Maintenance Engineers use the Requirements Document to do?",
        "options": [
            "Develop new validation tests.",
            "Planning the development process.",
            "Understand the system.",
            "Specify new requirements.",
            "Make sure they meet your needs."
        ],
        "correctOption": 2,
        "explanation": "The System Maintenance Engineers 'Use the requirements to understand the system' [cite: 409]."
    },
    {
        "stem": "What is the main problem of writing requirements in natural language, as quoted in the slides?",
        "options": [
            "Excess of mathematical equations.",
            "Use of complex conditional clauses that may confuse.",
            "The lack of diagrams.",
            "The high cost of writing.",
            "The difficulty in finding a document pattern."
        ],
        "correctOption": 1,
        "explanation": "Problems with requirements include 'Using complex conditional clauses that can confuse' and 'Consistent terminology'[cite: 497, 500]."
    },
    {
        "stem": "Which of the following alternatives is an activity of the System Engineering process?",
        "options": [
            "Source verification.",
            "Hardware performance analysis.",
            "Systems Integration.",
            "Source code creation of operating systems.",
            "Creating user interfaces."
        ],
        "correctOption": 2,
        "explanation": "The 'System Integration' is one of the main activities of the System Engineering process, where hardware and software subsystems are put together[cite: 354, 355, 356]."
    },
    {
        "stem": "Which of the following must always contain an introductory chapter in the Requirements Document?",
        "options": [
            "A summary of the system and a glossary.",
            "Safety and performance requirements.",
            "The system architecture and data structure.",
            "The system validation tests.",
            "The list of all system users."
        ],
        "correctOption": 0,
        "explanation": "The requirements document should always contain an introductory chapter providing a summary of the system, business needs supported by the system and a glossary[cite: 389]."
    },
    {
        "stem": "In the XYZ company standard, which section presents a high-level view of the system architecture, showing the distribution of module functions?",
        "options": [
            "Preface.",
            "General user requirements.",
            "System architecture.",
            "Hardware specification.",
            "Detailed software specification."
        ],
        "correctOption": 2,
        "explanation": "The 'System architecture' section presents a 'high-level view of the system's expected architecture, showing the distribution of the system module functions'[cite: 459, 460]."
    },
    {
        "stem": "What does 'Incomplete Requirements' mean?",
        "options": [
            "Requirements that cannot be encoded.",
            "Requirements that are written ambiguously.",
            "Requirements that do not cover all the necessary system functionality.",
            "Requirements that are very detailed.",
            "Requirements that aren't traceable."
        ],
        "correctOption": 2,
        "explanation": "Requirements Incomplete means that there is no information needed to build the system completely (the opposite of a 'Complete' requirement)."
    },
    {
        "stem": "What is the definition of Requirements Engineering?",
        "options": [
            "Only the requirements documentation.",
            "Just coding the requirements.",
            "The discipline to develop a complete, consistent and non-ambiguous specification of what the software product will do.",
            "The process involved in system maintenance.",
            "The discipline focused on validation tests."
        ],
        "correctOption": 2,
        "explanation": "Requirements Engineering is the discipline to develop a complete, consistent and non-ambiguous specification – which serves as the basis for an agreement between all parties involved – describing what the software product will do[cite: 298]."
    },
    {
        "stem": "In terms of cost of correction, if a requirement error is found in the design phase, the relative cost is 3 to 6. What would be the relative cost in the development testing phase?",
        "options": [
            "1.",
            "10.",
            "3-6.",
            "15-40.",
            "30-70."
        ],
        "correctOption": 3,
        "explanation": "The X Cost Correction chart shows that the relative cost in the development testing phase is 15-40[cite: 171]."
    },
    {
        "stem": "What does the requirements engineering discipline NOT define regarding the software product?",
        "options": [
            "What the product will do.",
            "What the product will NOT do (limits).",
            "The operating limitations.",
            "How the product will be implemented (architecture and coding).",
            "The basis for an agreement between the parties."
        ],
        "correctOption": 3,
        "explanation": "Requirements Engineering develops a specification that describes what the software product will do, but not how it will be done (implemented)."
    },
    {
        "stem": "What is the main function of the Appendix in the IEEE/ANSI 830-1998 standard for the requirements document?",
        "options": [
            "Define technical terms.",
            "List functional and non-functional requirements.",
            "Include additional information such as data flow models or Hardware interface specifications.",
            "Describe the product perspective.",
            "Summarize product scope."
        ],
        "correctOption": 2,
        "explanation": "Appendixes (section 4) are used to add additional information such as data flow models, Hardware interface specifications, and reusable Software Components."
    },
    {
        "stem": "The System Validation activity is done for which artifact?",
        "options": [
            "The final source code.",
            "The project schedule.",
            "The safety requirements.",
            "Requirements (The system is validated in relation to requirements).",
            "The coding pattern."
        ],
        "correctOption": 3,
        "explanation": "System Validation is the process in which the system is validated in relation to the defined requirements."
    },
    {
        "stem": "In terms of correction costs, what phase has the relative cost of 30 to 70, according to the 'X Cost Correction' chart?",
        "options": [
            "Design.",
            "Coding.",
            "Acceptance testing.",
            "Requirements.",
            "Operation."
        ],
        "correctOption": 2,
        "explanation": "The X Cost Correction chart indicates that the Acceptance testing phase has a relative cost of 30 to 70."
    },
    {
        "stem": "Which of the following Properties Does Emerging refer to the ease with which the system can be corrected, adapted or improved?",
        "options": [
            "Reliability.",
            "Security.",
            "Performance.",
            "Maintenance.",
            "Usability."
        ],
        "correctOption": 3,
        "explanation": "Maintenance (Maintainability) is the property that allows system correction, adaptation and improvement over time."
    },
    {
        "stem": "What is the main risk of a requirement writer assuming that readers have knowledge of the domain?",
        "options": [
            "It increases the cost of correction.",
            "Increases maintenance.",
            "It may lead to omission of crucial details and ambiguities for readers outside the domain.",
            "Make sure the source code is faster.",
            "Help with System Validation."
        ],
        "correctOption": 2,
        "explanation": "Assuming knowledge of the domain is a problem, because 'The writers assume that readers have knowledge of the domain', which leads to incomplete or ambiguous requirements for those outside."
    },
    {
        "stem": "In which section of the Requirements Document (IEEE standard) are listed 'Assumptions and Dependencies'?",
        "options": [
            "Introduction.",
            "General description.",
            "Specific requirements.",
            "Appendices.",
            "Glossary."
        ],
        "correctOption": 1,
        "explanation": "The 'Consumptions and dependencies' are listed in section 2, 'General Description' of the IEEE 830-1998 standard."
    },
    {
        "stem": "What is the main target audience for the 'System Architecture' section in the XYZ company standard?",
        "options": [
            "System customers.",
            "Project Managers.",
            "End Users.",
            "System Engineers and Programmers.",
            "Test engineers."
        ],
        "correctOption": 3,
        "explanation": "System Architecture presents a high-level view, showing the distribution of module functions, being crucial for Engineers and Programmers."
    },
    {
        "stem": "Which project failure factor of Standish Group (CHAOS) is directly related to Requirements Engineering, plus 'Incomplete requirements & specs'?",
        "options": [
            "Lack of executive support.",
            "Lack of competent personnel.",
            "Change of requirements and specifications.",
            "Inappropriate planning.",
            "Use of obsolete technology."
        ],
        "correctOption": 2,
        "explanation": "The third listed failure factor is 'Changing requirements & specs'."
    },
    {
        "stem": "What is the main function of Software Requirements Engineering within the System Engineering Process?",
        "options": [
            "Validate hardware subsystems.",
            "Manage requirements changes.",
            "Derive more detailed software requirements for the system software.",
            "Set the system architecture as a whole.",
            "Perform acceptance tests."
        ],
        "correctOption": 2,
        "explanation": "Software Requirements Engineering is the activity where 'most detailed software requirements are derived for the system software'."
    },
    {
        "stem": "What defines the 'Information Systems' system category?",
        "options": [
            "Systems where the software is used as a hardware controller.",
            "Special purpose systems for military control.",
            "Systems related mainly to the processing of information that are stored in some database.",
            "Systems that do not have non-functional requirements.",
            "Systems that can be configured from existing products (COTS)."
        ],
        "correctOption": 2,
        "explanation": "Information Systems are 'Related mainly to the processing of information that is stored in some database'."
    },
    {
        "stem": "What does Reliability Requirement mean?",
        "options": [
            "The ability of the system to be used on different platforms.",
            "The system's ability to operate continuously, seamlessly, for a defined period of time.",
            "The system response time to a query.",
            "Easy use of the system.",
            "The loading speed of the interface."
        ],
        "correctOption": 1,
        "explanation": "Reliability is an emerging property that refers to the system's ability to operate continuously, flawless."
    },
    {
        "stem": "What is the correct definition of 'System stakeholders'?",
        "options": [
            "Only the clients who pay for the project.",
            "Anyone affected in any way by the system.",
            "Just the analyst and the project manager.",
            "Just the developers and testers.",
            "Only the end users of the system."
        ],
        "correctOption": 1,
        "explanation": "System stakeholders are 'Anyone affected somehow by the system'."
    },
    {
        "stem": "What is the main guideline for the writing of requirements, aiming at clarity?",
        "options": [
            "Use complex and technical language.",
            "Use diagrams only at the end of the document.",
            "Use language in a simple, consistent and concise way.",
            "Speculate on the knowledge of the reader.",
            "Focus only on hardware requirements."
        ],
        "correctOption": 2,
        "explanation": "A writing guideline is 'Use language in a simple, consistent and concise way'."
    },
    {
        "stem": "What does Requirements Engineering seek to avoid with specification discipline?",
        "options": [
            "High cost of coding.",
            "Full, consistent, non-ambiguous specification.",
            "Misunderstandings between customers and software engineers.",
            "Use of diagrams and models.",
            "The performance requirement."
        ],
        "correctOption": 2,
        "explanation": "The discipline aims to avoid misunderstandings between customers, requirements developers and software engineers."
    },
    {
        "stem": "What is the main function of the project manager in relation to the Requirements Document?",
        "options": [
            "Implement source code.",
            "Use requirements to plan the system development process.",
            "Develop validation tests.",
            "Write functional requirements.",
            "Be the end user of the system."
        ],
        "correctOption": 1,
        "explanation": "Project Managers 'Use requirements documents to plan a proposal for the system and the system development process'."
    },
    {
        "stem": "What is the difference between Embedded Systems and Information Systems?",
        "options": [
            "Embedded systems process database information; Information systems control hardware.",
            "Embedded systems use software to control hardware; Information Systems process stored data.",
            "Embedded systems are always COTS; Information systems are always customized.",
            "There's no difference, they're synonymous.",
            "Embedded systems are more expensive."
        ],
        "correctOption": 1,
        "explanation": "Embedded systems use software as hardware controller. Information Systems are related to the processing of information stored in a database."
    },
    {
        "stem": "What is the relative cost of fixing an error if it is found in the Coding phase?",
        "options": [
            "1.",
            "3-6.",
            "10.",
            "15-40.",
            "30-70."
        ],
        "correctOption": 2,
        "explanation": "The X Cost Correction chart indicates that the relative cost in the Coding phase is 10."
    },
    {
        "stem": "What should the Requirements Document (in addition to services and functions) describe as slides?",
        "options": [
            "The company's sales structure.",
            "The limitations on which the system should operate.",
            "The programming language preferences.",
            "The 1% encoding errors.",
            "The cost of the project."
        ],
        "correctOption": 1,
        "explanation": "The requirement document describes 'The services and functions that the system must provide; • The limitations on which the system should operate'."
    },
    {
        "stem": "What is a common problem with the writing of requirements, listed in the material?",
        "options": [
            "Use of functional programming languages.",
            "Adoption of standard IEEE 830.",
            "Consistent terminology.",
            "The concise and simple writing.",
            "The use of diagrams."
        ],
        "correctOption": 2,
        "explanation": "Problems with requirements include inconsistent terminology."
    },
    {
        "stem": "In which section of the standard IEEE/ANSI 830-1998 would the requirement 'The system should support at least 20 transactions per second' be detailed?",
        "options": [
            "1. Introduction.",
            "2. General description.",
            "3. Specific requirements (Non-Functional/Performance).",
            "4. Appendices.",
            "1.3 Definitions."
        ],
        "correctOption": 2,
        "explanation": "This is a Non-Functional Performance Requirement and would be detailed in section 3, 'Specific Requirements'."
    },
    {
        "stem": "The 'Architecture Project' (Architecture Design) activity is the first activity in Systems Engineering (diagram V). What's the matter?",
        "options": [
            "Systems validation.",
            "System Requirements Engineering.",
            "Requirements Partition.",
            "Subsystem Development.",
            "Systems Integration."
        ],
        "correctOption": 2,
        "explanation": "The diagram V shows that the 'Requirement Partition' follows the 'Architecture Project'."
    },
    {
        "stem": "What is the main function of the 'Preface' in the standard XYZ company?",
        "options": [
            "Define technical terms.",
            "Describe the software features.",
            "Describe the hardware on which the system will run.",
            "Describe the history of the versions and define the readers of the document.",
            "Specify detailed algorithms."
        ],
        "correctOption": 3,
        "explanation": "The Preface 'Defines the readers of the document and describes the history of the versions, including an explanation of the creation of new versions and a summary of the changes made in each version'."
    },
    {
        "stem": "According to the graph, most of the rework is related to requirements that present what characteristic?",
        "options": [
            "They're functional.",
            "They're accurate and consistent.",
            "They are inadequate, inconsistent and inaccurate.",
            "They focus on programming logic.",
            "They do not contain diagrams."
        ],
        "correctOption": 2,
        "explanation": "The 'Reasons for Rework' slide states that 'Most rework is related to inadequate, inconsistent, inaccurate requirements'."
    },
    {
        "stem": "Which of the following is an example of 'Domain Request'?",
        "options": [
            "The system must be available 24/7.",
            "The system should be compatible with government API for tax calculation ( domain-specific rule).",
            "The system must use Python language.",
            "The system must be highly usable.",
            "The system must allow login."
        ],
        "correctOption": 1,
        "explanation": "Domain requirements arise from the rules and characteristics of the application area. Integration with a government-specific API is a clear example of domain restriction."
    },
    {
        "stem": "What is the correct description of 'Command and Control Systems'?",
        "options": [
            "Systems that only process database information.",
            "Systems where the software is used as a hardware controller.",
            "A combination of information systems and embedded systems, providing information to make decisions.",
            "Systems that only issue management reports.",
            "Systems that are configured from existing products."
        ],
        "correctOption": 2,
        "explanation": "Command and Control systems are 'essentially a combination of information systems and embedded systems, where special purpose computers provide information that is collected, stored and used to make decisions'."
    },
    {
        "stem": "According to the graph, what error has a correction cost of 82% in the 'Requirements Errors' phase?",
        "options": [
            "Logic Error.",
            "Design Errors.",
            "Coding Errors.",
            "Other Errors.",
            "Requirements Errors."
        ],
        "correctOption": 4,
        "explanation": "The 'The Cost to Fix Software Effects' chart indicates that 82% of the correction cost is in 'Requirements Errors'."
    },
    {
        "stem": "What is the main function of 'Summary of the rest of the document' in the Introduction section of the IEEE 830-1998?",
        "options": [
            "Define technical terms.",
            "Ensure traceability.",
            "Allow the reader to easily find the section that interests you.",
            "List software versions.",
            "Describe product features."
        ],
        "correctOption": 2,
        "explanation": "The summary of the remainder of the document allows the reader an overview of the structure, facilitating navigation."
    },
    {
        "stem": "What is the main problem that Requirements Engineering tries to solve, according to motivation?",
        "options": [
            "The lack of programmers.",
            "The high cost of changing requirements after they have been agreed.",
            "The difficulty in choosing the best programming language.",
            "The excess of functional requirements.",
            "Low quality source code."
        ],
        "correctOption": 1,
        "explanation": "The motivation is to solve the problem of 'high cost for changing requirements after they have been agreed'."
    },
    {
        "stem": "What is the correct definition of 'Functional Requirement'?",
        "options": [
            "Define performance and safety restrictions.",
            "Define the services and functions the system must provide.",
            "Define the company's goals.",
            "Define hardware limitations.",
            "Define the emerging properties."
        ],
        "correctOption": 1,
        "explanation": "Functional requirements define the services and functions the system must provide."
    },
    {
        "stem": "What do 'Request, Analysis and Documentation' represent in Requirements Engineering?",
        "options": [
            "The software life cycle.",
            "The test phases of the system.",
            "The main activities of Requirements Engineering.",
            "Project failure factors.",
            "The components of software architecture."
        ],
        "correctOption": 2,
        "explanation": "Requirements engineering concerns the elicitation, analysis and documentation of the system requirements."
    },
    {
        "stem": "What is the purpose of 'Specify requirements quantitatively'?",
        "options": [
            "Make sure they're ambiguous.",
            "Make sure they're easy to encode.",
            "Help in objective verification and measurement of requirements.",
            "Increase correction cost.",
            "Decrease traceability."
        ],
        "correctOption": 2,
        "explanation": "Specify requirements in a quantitative way (e.g. '20 transactions per second') is a guideline to assist in objective verification and measurement of the requirement."
    },
    {
        "stem": "What is the main activity of System Requirements Engineering at the beginning of the process?",
        "options": [
            "Encoding subsystems.",
            "Integrate hardware.",
            "Establish and write the system requirements as a whole to be understood by stakeholders.",
            "Do acceptance tests.",
            "Set the detailed architecture."
        ],
        "correctOption": 2,
        "explanation": "System Requirements Engineering is the activity where 'System requirements as a whole are established and written to be understood by all stakeholders (stakeholders)'."
    },
    {
        "stem": "What should be avoided in writing requirements not to confuse readers?",
        "options": [
            "The use of diagrams.",
            "The use of simple and concise language.",
            "The use of complex conditional clauses.",
            "The use of consistent terminology.",
            "The definition of standard templates."
        ],
        "correctOption": 2,
        "explanation": "We must avoid 'Using complex conditional clauses that may confuse' and 'Consistent Terminology'."
    },
    {
    "stem": "What defines Requirements Engineering in the context of Software Engineering?",
    "options": [
      "The creation of software prototypes",
      "The acquisition and application of knowledge to create, improve, and implement information systems",
      "The simple documentation of software",
      "The execution of software tests to validate functionalities",
      "The analysis of source code to verify its performance"
    ],
    "correctOption": 1,
    "explanation": "The acquisition and application of knowledge to create, improve, and implement information systems"
  },
  {
    "stem": "According to the text, what is the main function of Requirements Engineering?",
    "options": [
      "To perform business analysis and develop user interfaces",
      "To elicit, document, and maintain requirements for software",
      "To implement and test software systems",
      "To perform the integration of external systems",
      "To validate the quality of the source code"
    ],
    "correctOption": 1,
    "explanation": "To elicit, document, and maintain requirements for software"
  },
  {
    "stem": "What does \"engineering\" mean in the context of Requirements Engineering?",
    "options": [
      "It refers only to the creation of code for the software",
      "It is related to the application of knowledge to solve problems and meet business objectives",
      "It simply means the documentation of requirements",
      "It relates to the construction of technological infrastructure for the software",
      "It exclusively means performing software tests"
    ],
    "correctOption": 1,
    "explanation": "It is related to the application of knowledge to solve problems and meet business objectives"
  },
  {
    "stem": "What is the main benefit of Requirements Engineering, as discussed in the text?",
    "options": [
      "Delivering software faster",
      "Ensuring that requirements meet business objectives and maintain quality throughout the project lifecycle",
      "Increasing project cost",
      "Focusing exclusively on software design",
      "Helping with user training"
    ],
    "correctOption": 1,
    "explanation": "Ensuring that requirements meet business objectives and maintain quality throughout the project lifecycle"
  },
  {
    "stem": "What does Requirements Engineering aim to achieve by involving stakeholders (interested parties) during development?",
    "options": [
      "Ensuring that the software has an attractive visual design",
      "Helping to define requirements for the testing phases",
      "Ensuring clear and continuous communication about customer needs",
      "Only documenting the requirements",
      "Focusing on meeting all the technical aspects of the solution"
    ],
    "correctOption": 2,
    "explanation": "Ensuring clear and continuous communication about customer needs"
  },
  {
    "stem": "What is the meaning of the term \"engineering\" in Requirements Engineering?",
    "options": [
      "Creation of source code and software tests.",
      "Acquisition and application of knowledge to solve problems, improve, and implement technological solutions.",
      "Implementation of hardware solutions and infrastructure.",
      "Project management and development schedules.",
      "Integration tests and software validation."
    ],
    "correctOption": 1,
    "explanation": "Acquisition and application of knowledge to solve problems, improve, and implement technological solutions."
  },
  {
    "stem": "In relation to the context of Requirements Engineering, what does the definition of \"quality\" involve?",
    "options": [
      "Adherence to requirements and customer satisfaction with the visual design.",
      "Suitability to the programming standards used.",
      "Fitness for use, that is, correctly meeting the business needs and objectives.",
      "Maintenance of the source code over time.",
      "Adherence to the development time."
    ],
    "correctOption": 2,
    "explanation": "Fitness for use, that is, correctly meeting the business needs and objectives."
  },
  {
    "stem": "What is the main distinction between \"requirements discipline\" and \"requirements phase\"?",
    "options": [
      "The requirements discipline involves only documentation, while the requirements phase is limited to test execution.",
      "The requirements discipline encompasses all activities of elicitation, validation, and management of requirements, while the requirements phase is a specific part of the project lifecycle.",
      "The requirements phase is where system design activities are carried out.",
      "The requirements discipline involves only source code analysis.",
      "The requirements phase is linked to project cost management."
    ],
    "correctOption": 1,
    "explanation": "The requirements discipline encompasses all activities of elicitation, validation, and management of requirements, while the requirements phase is a specific part of the project lifecycle."
  },
  {
    "stem": "In which phase of a software project does Requirements Engineering have the highest concentration of effort, according to the COCOMO II chart?",
    "options": [
      "Construction phase",
      "Elaboration phase",
      "Transition phase",
      "Inception phase",
      "Testing phase"
    ],
    "correctOption": 1,
    "explanation": "Elaboration phase"
  },
  {
    "stem": "What are the main components of the software requirements specification?",
    "options": [
      "Software design and source code documentation.",
      "Project overview, glossary, system models, functional and non-functional requirements.",
      "Only user stories.",
      "Listing all errors found during the testing phase.",
      "Implementation components and database documentation."
    ],
    "correctOption": 1,
    "explanation": "Project overview, glossary, system models, functional and non-functional requirements."
  },
  {
    "stem": "When is the requirements specification considered \"complete\"?",
    "options": [
      "When it contains all functional and non-functional requirements without any failure of understanding.",
      "When the requirements are discussed with the development team, without the need for documentation.",
      "When it is validated by all involved parties, but without additional detail.",
      "When the main functionalities of the software are simply documented.",
      "When it contains only the documented customer needs without any quality analysis."
    ],
    "correctOption": 0,
    "explanation": "When it contains all functional and non-functional requirements without any failure of understanding."
  },
  {
    "stem": "What is the role of Requirements Engineering in the agile development strategy?",
    "options": [
      "Restricting the definition of requirements to the initial phases of the project.",
      "Working iteratively and continuously, addressing changes in customer needs throughout development.",
      "Having no role, as agile methodologies do not use requirements.",
      "Creating extensive documentation before the start of development.",
      "Helping only in the finalization of the project, ensuring product conformity with the initial scope."
    ],
    "correctOption": 1,
    "explanation": "Working iteratively and continuously, addressing changes in customer needs throughout development."
  },
  {
    "stem": "What is the \"Agile Manifesto,\" as mentioned in the context of Requirements Engineering?",
    "options": [
      "An approach that prioritizes detailed and rigid documentation of requirements.",
      "A methodology that ensures all requirements are met without changes.",
      "A set of principles that favors collaboration with the customer, flexibility, and quick response to changes.",
      "A strategy for waterfall development, where requirements are defined once and followed strictly.",
      "A software development model without interaction with stakeholders."
    ],
    "correctOption": 2,
    "explanation": "A set of principles that favors collaboration with the customer, flexibility, and quick response to changes."
  },
  {
    "stem": "What is the advantage of a \"clear\" and unambiguous requirements specification?",
    "options": [
      "It reduces the need for communication with customers and developers.",
      "It allows any team member, even without experience, to quickly understand the requirements.",
      "It ensures that all design decisions are documented.",
      "It facilitates the creation of automated tests.",
      "It makes the software source code more optimized."
    ],
    "correctOption": 1,
    "explanation": "It allows any team member, even without experience, to quickly understand the requirements."
  },
  {
    "stem": "How can requirements documentation help in the relationship with customers?",
    "options": [
      "Ensuring that all requirements are met without the need for further communication.",
      "Facilitating the understanding of how the software will be developed and what will be delivered, allowing customers to approve or make adjustments before the start of development.",
      "Preventing scope changes during development.",
      "Allowing customers to intervene directly in the source code.",
      "Ensuring that the software will be 100% bug-free."
    ],
    "correctOption": 1,
    "explanation": "Facilitating the understanding of how the software will be developed and what will be delivered, allowing customers to approve or make adjustments before the start of development."
  },
  {
    "stem": "Which of the following options correctly describes the process of \"requirements elicitation\"?",
    "options": [
      "Process of creating prototypes to validate functionalities.",
      "Process of identifying and understanding customer needs to determine system requirements.",
      "Process of writing the source code based on customer specifications.",
      "Process of performing tests on the developed software.",
      "Process of creating delivery documentation for stakeholders."
    ],
    "correctOption": 1,
    "explanation": "Process of identifying and understanding customer needs to determine system requirements."
  },
  {
    "stem": "What should the requirements specification avoid, according to the good practices described in the text?",
    "options": [
      "Use of technical terminology and detailing of functionalities.",
      "Excessive detailing, focusing only on system design aspects.",
      "Exclusive focus on the customer, without considering the development team.",
      "Ambiguity, which can lead to different interpretations of requirements by different stakeholders.",
      "Definition of clear and specific objectives for all involved parties."
    ],
    "correctOption": 3,
    "explanation": "Ambiguity, which can lead to different interpretations of requirements by different stakeholders."
  },
  {
    "stem": "Which alternative is one of the main challenges in software requirements specification?",
    "options": [
      "Setting unrealistic deadlines for development.",
      "Ensuring that all requirements are overly detailed from the start of the project.",
      "Aligning stakeholders' needs with the technical capabilities of the project.",
      "Developing prototypes without customer involvement.",
      "Reducing communication with customers to avoid frequent changes in requirements."
    ],
    "correctOption": 2,
    "explanation": "Aligning stakeholders' needs with the technical capabilities of the project."
  },
  {
    "stem": "According to the text, what is the difference between \"functional requirements\" and \"non-functional requirements\"?",
    "options": [
      "Functional requirements describe the functions the system must perform, while non-functional requirements refer to qualities such as performance and usability.",
      "Functional requirements are related to system architecture, while non-functional requirements concern system behavior.",
      "Functional requirements describe technical aspects of the system, while non-functional ones deal with graphic design.",
      "Functional requirements are not necessary for software construction, unlike non-functional requirements.",
      "There is no difference between them, both refer to technical implementation aspects."
    ],
    "correctOption": 0,
    "explanation": "Functional requirements describe the functions the system must perform, while non-functional requirements refer to qualities such as performance and usability."
  },
  {
    "stem": "What is the reason for having an appropriate \"level of detail\" in the requirements specification?",
    "options": [
      "To allow the software to be completely designed before development.",
      "To avoid ambiguities and ensure that all involved parties understand what will be delivered.",
      "To ensure that the source code is as efficient as possible.",
      "To ensure that tests are executed without customer participation.",
      "To allow software design to be done without customer participation."
    ],
    "correctOption": 1,
    "explanation": "To avoid ambiguities and ensure that all involved parties understand what will be delivered."
  },
  {
    "stem": "In a software project, what is the role of the requirements analyst?",
    "options": [
      "Developing the system architecture and defining coding standards.",
      "Eliciting, documenting, validating, and managing requirements in collaboration with stakeholders.",
      "Implementing the software functionalities based on the requirements.",
      "Creating user interface prototypes and conducting usability tests.",
      "Monitoring the execution of the source code during the development phase."
    ],
    "correctOption": 1,
    "explanation": "Eliciting, documenting, validating, and managing requirements in collaboration with stakeholders."
  },
  {
    "stem": "What is a \"Glossary\" in the requirements specification?",
    "options": [
      "A set of business rules that the system must meet.",
      "A document that lists all functional and non-functional requirements of the project.",
      "A definition of the technical terms and acronyms used in the requirements document, to ensure that all stakeholders understand them in the same way.",
      "A set of use case diagrams to illustrate system interactions.",
      "A list of functionalities that the system should not possess."
    ],
    "correctOption": 2,
    "explanation": "A definition of the technical terms and acronyms used in the requirements document, to ensure that all stakeholders understand them in the same way."
  },
  {
    "stem": "What is the main difference between \"system models\" and \"functional requirements list\" in the requirements specification?",
    "options": [
      "System models show the technical architecture of the system, while the functional requirements list describes user needs.",
      "System models refer to code implementation, while the functional requirements list describes customer requirements.",
      "System models are used for database design, while functional requirements deal with the usability part of the software.",
      "System models are testing tools, while functional requirements describe the external interfaces of the software.",
      "There is no difference between them, both are used to test the software."
    ],
    "correctOption": 0,
    "explanation": "System models show the technical architecture of the system, while the functional requirements list describes user needs."
  },
  {
    "stem": "What does agile methodology advocate about requirements documentation?",
    "options": [
      "Requirements documentation should be done before any customer interaction.",
      "Documentation should be detailed and rigidly followed throughout the entire project lifecycle.",
      "Documentation should be minimal and adaptable, focusing on constant collaboration with the customer.",
      "Documentation should be a way to ensure that the software will be delivered without faults.",
      "Documentation should be done after software delivery for adjustments."
    ],
    "correctOption": 2,
    "explanation": "Documentation should be minimal and adaptable, focusing on constant collaboration with the customer."
  },
  {
    "stem": "What is the objective of \"verification\" and \"validation\" of the requirements specification?",
    "options": [
      "Ensuring that the requirements have been fully coded into the software.",
      "Checking if the requirements are complete, consistent, and correctly implemented.",
      "Confirming that the software has all the non-functional requirements.",
      "Validating if customer needs have been completely met without errors.",
      "Ensuring that the system has been tested according to the requirements."
    ],
    "correctOption": 1,
    "explanation": "Checking if the requirements are complete, consistent, and correctly implemented."
  },
  {
    "stem": "What is a \"non-functional requirement\"?",
    "options": [
      "A requirement related to software performance, such as response time or memory usage.",
      "A requirement that describes the system's behavior in terms of functionalities.",
      "A requirement that defines the interfaces between systems.",
      "A requirement that describes user needs, such as a user story.",
      "A requirement related to system architecture, such as choice of programming language."
    ],
    "correctOption": 0,
    "explanation": "A requirement related to software performance, such as response time or memory usage."
  },
  {
    "stem": "What characterizes a \"prioritized\" requirement in the requirements specification?",
    "options": [
      "A requirement that cannot be changed during the development cycle.",
      "A requirement that must be met based on importance to the customer or impact on the project.",
      "A requirement that should only be implemented after software completion.",
      "A requirement that is designated as optional for the customer.",
      "A requirement that describes a problem in the current system."
    ],
    "correctOption": 1,
    "explanation": "A requirement that must be met based on importance to the customer or impact on the project."
  },
  {
    "stem": "What is the main advantage of using \"user stories\" in agile methodologies for requirements specification?",
    "options": [
      "They describe requirements technically, detailed, and clearly.",
      "They offer a simple and concise way to describe customer needs, focusing on the value to be delivered.",
      "They detail the system interfaces.",
      "They are used only for usability tests.",
      "They provide source code specifications for developers."
    ],
    "correctOption": 1,
    "explanation": "They offer a simple and concise way to describe customer needs, focusing on the value to be delivered."
  },
  {
    "stem": "What is the purpose of the \"Product Backlog\" in agile methodologies?",
    "options": [
      "Storing the system source codes.",
      "Recording all test cases to be performed.",
      "Maintaining a record of user stories and other requirements, organized for prioritization and planning.",
      "Listing all bugs found during development.",
      "Documenting the software design in detail."
    ],
    "correctOption": 2,
    "explanation": "Maintaining a record of user stories and other requirements, organized for prioritization and planning."
  },
  {
    "stem": "In the context of Requirements Engineering, what does \"requirements traceability\" mean?",
    "options": [
      "The ability to map requirements to the functionalities implemented in the source code.",
      "The ability to document all errors found during testing.",
      "The possibility of tracing design decisions through the source code.",
      "The process of checking if requirements meet a quality standard.",
      "The ability to relate requirements to business objectives and other development artifacts."
    ],
    "correctOption": 4,
    "explanation": "The ability to relate requirements to business objectives and other development artifacts."
  },
  {
    "stem": "What is a \"correct requirements specification\"?",
    "options": [
      "When the requirements are well-detailed and specified, even if they do not meet the business objective.",
      "When the requirements are not documented, but implemented directly into the source code.",
      "When each specified requirement helps satisfy a legitimate business need and is free from redundancies or errors.",
      "When all requirements are defined, but are not traceable in the project.",
      "When the requirements specification contains only non-functional requirements."
    ],
    "correctOption": 2,
    "explanation": "When each specified requirement helps satisfy a legitimate business need and is free from redundancies or errors."
  },
  {
    "stem": "In a software project, what is the best way to ensure that requirements are \"complete\"?",
    "options": [
      "Including all possible functionalities the software can have, without considering customer needs.",
      "Documenting all requirements related to software design.",
      "Ensuring that all functional and non-functional requirements necessary for project success are described and without omissions.",
      "Performing code documentation before defining requirements.",
      "Ensuring that functional requirements are more detailed than non-functional ones."
    ],
    "correctOption": 2,
    "explanation": "Ensuring that all functional and non-functional requirements necessary for project success are described and without omissions."
  },
  {
    "stem": "What is the main difference between \"business requirement\" and \"technical requirement\" in a Requirements Engineering project?",
    "options": [
      "Business requirement is focused on technical aspects, while technical requirement describes system functionalities.",
      "Business requirement refers to what the customer wants to achieve with the software, while technical requirement describes how the system should function technically to meet those needs.",
      "Business requirement is related to graphic design, while technical requirement describes only system functionalities.",
      "There is no difference, as both are requirements that describe the expected system behavior.",
      "Business requirement is an optional requirement, while technical requirement must be followed strictly."
    ],
    "correctOption": 1,
    "explanation": "Business requirement refers to what the customer wants to achieve with the software, while technical requirement describes how the system should function technically to meet those needs."
  },
  {
    "stem": "What is the \"Agile Manifesto,\" as mentioned in the context of Requirements Engineering?",
    "options": [
      "An approach that prioritizes detailed and rigid documentation of requirements.",
      "A methodology that ensures all requirements are met without changes.",
      "A set of principles that favors collaboration with the customer, flexibility, and quick response to changes.",
      "A strategy for waterfall development, where requirements are defined once and followed strictly.",
      "A software development model without interaction with stakeholders."
    ],
    "correctOption": 2,
    "explanation": "A set of principles that favors collaboration with the customer, flexibility, and quick response to changes."
  },
  {
    "stem": "What is considered a \"deficiency\" in a requirements specification?",
    "options": [
      "When the document contains too many details about the system design.",
      "When the specification does not meet any of the stakeholders' needs.",
      "When the specification is vague, not clearly defining the requirements the system must meet.",
      "When the document is excessively technical, hindering customer understanding.",
      "When the specification is too detailed and cannot be modified."
    ],
    "correctOption": 2,
    "explanation": "When the specification is vague, not clearly defining the requirements the system must meet."
  },
  {
    "stem": "Which alternative is an example of a \"requirements constraint\"?",
    "options": [
      "The system must allow the user to register their personal information.",
      "The system must be compatible with Windows and Linux operating systems.",
      "The system must have a friendly user interface.",
      "The system must be fast and efficient in data processing.",
      "The system must be capable of operating with a database of up to 10 TB."
    ],
    "correctOption": 4,
    "explanation": "The system must be capable of operating with a database of up to 10 TB."
  },
  {
    "stem": "What characterizes the requirements specification as \"modifiable\"?",
    "options": [
      "When it can be easily changed to adapt to changes in the project or in the understanding of requirements.",
      "When changes can only be made in the software source code.",
      "When the requirements are fixed and cannot be changed during development.",
      "When the documentation does not allow changes after initial approval.",
      "When changes are made without communicating with stakeholders."
    ],
    "correctOption": 0,
    "explanation": "When it can be easily changed to adapt to changes in the project or in the understanding of requirements."
  },
  {
    "stem": "In a software project, what does \"verifiability\" of requirements mean?",
    "options": [
      "The ability to measure system conformity with requirements using tests or other techniques.",
      "The possibility that requirements are documented without the need for tests.",
      "The possibility that the requirements are understood by all stakeholders, without exception.",
      "The ability to perform tests on the system source code.",
      "The ease with which requirements can be implemented without system changes."
    ],
    "correctOption": 0,
    "explanation": "The ability to measure system conformity with requirements using tests or other techniques."
  },
  {
    "stem": "What should be avoided in a requirements specification to ensure it is clear?",
    "options": [
      "Using ambiguous language, with vague terms that can be interpreted in various ways.",
      "Using models and diagrams to illustrate requirements visually.",
      "Clearly defining what is being requested without information overload.",
      "Using consistent technical terminology to avoid confusion.",
      "Making use of a glossary to define specific terms."
    ],
    "correctOption": 0,
    "explanation": "Using ambiguous language, with vague terms that can be interpreted in various ways."
  },
  {
    "stem": "What does \"fitness for use\" mean in relation to requirements?",
    "options": [
      "The ability of requirements to be understood by all parts of the project.",
      "The ability of requirements to meet customer objectives effectively and efficiently.",
      "The ability for requirements to apply to all phases of the project, without the need for changes.",
      "The ability for requirements to be easily implemented in code.",
      "The ability for requirements to quickly adapt to changes during development."
    ],
    "correctOption": 1,
    "explanation": "The ability of requirements to meet customer objectives effectively and efficiently."
  },
  {
    "stem": "What is a \"functional requirement\"?",
    "options": [
      "A requirement that describes how the software should be technically implemented.",
      "A requirement that describes the services or functions the system must provide to its users.",
      "A requirement that defines the hardware and software constraints of the system.",
      "A requirement that is related to system performance and scalability.",
      "A requirement that describes the system behavior in error situations."
    ],
    "correctOption": 1,
    "explanation": "A requirement that describes the services or functions that the system must provide to its users."
  },
  {
    "stem": "What is the importance of involving stakeholders in Requirements Engineering?",
    "options": [
      "Stakeholders do not need to be consulted, as developers can work independently.",
      "Stakeholder involvement ensures that requirements meet the real needs and expectations of customers and end-users.",
      "Stakeholders should only be consulted at the end of the project for requirements validation.",
      "The only important stakeholder is the development team, as they are the ones who will implement the requirements.",
      "Stakeholder involvement is not necessary, as requirements can be defined exclusively by the project management team."
    ],
    "correctOption": 1,
    "explanation": "Stakeholder involvement ensures that requirements meet the real needs and expectations of customers and end-users."
  },
  {
    "stem": "In the context of Requirements Engineering, what does \"traceable requirement\" mean?",
    "options": [
      "A requirement that is completely documented and cannot be changed.",
      "A requirement that can be mapped to project artifacts, such as test cases, source code, and design documents.",
      "A requirement that is detailed according to customer expectations.",
      "A requirement that is fully implemented and tested.",
      "A requirement that is added after software delivery."
    ],
    "correctOption": 1,
    "explanation": "A requirement that can be mapped to project artifacts, such as test cases, source code, and design documents."
  },
  {
    "stem": "What characterizes a \"consistent requirements specification\"?",
    "options": [
      "When all requirements are met, but unrelated to business objectives.",
      "When there are no contradictions between the requirements described in the document and all parts of the project.",
      "When requirements are described without the need for customer feedback.",
      "When the specification is created quickly without the need for validation.",
      "When the documentation is only related to system design."
    ],
    "correctOption": 1,
    "explanation": "When there are no contradictions between the requirements described in the document and all parts of the project."
  },
  {
    "stem": "When should requirements be validated in a software project?",
    "options": [
      "Before the design and development phase.",
      "During the development phase, as the code is implemented.",
      "After project completion, during final tests.",
      "When the system is in production, after being delivered to the customer.",
      "During all phases of the project, continuously."
    ],
    "correctOption": 4,
    "explanation": "During all phases of the project, continuously."
  },
  {
    "stem": "What is the difference between \"business requirement\" and \"technical requirement\" in a Requirements Engineering project?",
    "options": [
      "The business requirement describes what the system must do, while the technical requirement describes how the system should be implemented.",
      "The technical requirement describes the system behavior, while the business requirement deals with usability aspects.",
      "The technical requirement is a list of functionalities, while the business requirement describes data flows.",
      "The business requirement is just a suggestion, while the technical requirement is mandatory.",
      "The business requirement describes the system's interactions with the user."
    ],
    "correctOption": 0,
    "explanation": "The business requirement describes what the system must do, while the technical requirement describes how the system should be implemented."
  },
  {
    "stem": "What is a \"compatibility requirement\" in a software project?",
    "options": [
      "A requirement that defines the hardware and software environments in which the system must operate.",
      "A requirement that describes the interactions between the system and other software platforms.",
      "A requirement that defines the system response times.",
      "A requirement that specifies user access permissions.",
      "A requirement that describes the system architecture."
    ],
    "correctOption": 1,
    "explanation": "A requirement that describes the interactions between the system and other software platforms."
  },
  {
    "stem": "How does Requirements Engineering relate to the testing phase?",
    "options": [
      "It defines the requirements that must be met and serves as the basis for test case elaboration.",
      "It is only responsible for source code documentation.",
      "It defines the system architecture, but is not directly related to testing.",
      "It ensures that the software will be developed in an agile manner and without errors.",
      "It describes user interaction with the system."
    ],
    "correctOption": 0,
    "explanation": "It defines the requirements that must be met and serves as the basis for test case elaboration."
  },
  {
    "stem": "What is the main function of a \"glossary\" in a requirements specification?",
    "options": [
      "To specify the technical terms and concepts used throughout the document to ensure uniform understanding.",
      "To define the system functionalities technically.",
      "To describe the system architecture in detail.",
      "To list all functional and non-functional requirements of the system.",
      "To describe the system data flows."
    ],
    "correctOption": 0,
    "explanation": "To specify the technical terms and concepts used throughout the document to ensure uniform understanding."
  },
  {
    "stem": "What is a \"usability requirement\"?",
    "options": [
      "A requirement related to system performance.",
      "A requirement that describes how users interact with the system and the ease of that interaction.",
      "A requirement that defines the system functionalities.",
      "A requirement that specifies the data to be processed.",
      "A requirement that describes the software architecture."
    ],
    "correctOption": 1,
    "explanation": "A requirement that describes how users interact with the system and the ease of that interaction."
  },
  {
    "stem": "What characterizes the \"suitability of requirements\" in a software project?",
    "options": [
      "The ability of requirements to be easily implemented by the developer.",
      "The ability of requirements to meet customer needs and objectives efficiently.",
      "The ability of requirements to be validated after software delivery.",
      "The ability of requirements to be kept secret during the project lifecycle.",
      "The ability of requirements not to require changes throughout the project."
    ],
    "correctOption": 1,
    "explanation": "The ability of requirements to meet customer needs and objectives efficiently."
  },
  {
    "stem": "What is a \"reliability requirement\"?",
    "options": [
      "A requirement that describes system performance in terms of response time.",
      "A requirement that defines the amount of memory needed for the system.",
      "A requirement that describes the system's ability to operate continuously, without failures.",
      "A requirement that describes the system functionalities.",
      "A requirement that specifies how data will be stored in the database."
    ],
    "correctOption": 2,
    "explanation": "A requirement that describes the system's ability to operate continuously, without failures."
  },
  {
    "stem": "In a software project, how is it ensured that requirements are complete?",
    "options": [
      "Ensuring that all requirements are technically described.",
      "Validating requirements with stakeholders to ensure that all needs are met.",
      "Detailing all functionalities before starting development.",
      "Focusing exclusively on non-functional requirements.",
      "Documenting only the most important requirements."
    ],
    "correctOption": 1,
    "explanation": "Validating requirements with stakeholders to ensure that all needs are met."
  },
  {
    "stem": "What is the role of \"requirements audit\" in a software project?",
    "options": [
      "Checking if the requirements are being followed during the development phase.",
      "Ensuring that the source code is adequate for the requirements.",
      "Validating the system documentation, without reviewing the original requirements.",
      "Monitoring system performance during development.",
      "Performing tests to ensure that the software meets customer requirements."
    ],
    "correctOption": 0,
    "explanation": "Checking if the requirements are being followed during the development phase."
  },
  {
    "stem": "What characterizes a \"maintenance requirement\"?",
    "options": [
      "A requirement that describes how the system will be updated and corrected over time.",
      "A requirement related to system design.",
      "A requirement that defines user interaction with the system.",
      "A requirement that specifies system response times.",
      "A requirement that describes system behavior during failures."
    ],
    "correctOption": 0,
    "explanation": "A requirement that describes how the system will be updated and corrected over time."
  },
  {
    "stem": "What is the main difference between \"explicit\" and \"implicit\" requirements?",
    "options": [
      "Explicit requirements are clearly defined, while implicit ones are assumed or not directly mentioned.",
      "Explicit requirements are mandatory, while implicit ones can be changed during development.",
      "Explicit requirements describe system functionalities, while implicit ones are related to security.",
      "Explicit requirements are defined by the customer, while implicit ones are defined by the development team.",
      "There is no difference, both are the same."
    ],
    "correctOption": 0,
    "explanation": "Explicit requirements are clearly defined, while implicit ones are assumed or not directly mentioned."
  },
  {
    "stem": "What is a \"compatibility requirement\"?",
    "options": [
      "A requirement that specifies the system's ability to function with different devices or platforms.",
      "A requirement that defines system performance.",
      "A requirement that describes how the system will be secure against external failures.",
      "A requirement that describes the system's interaction with the customer.",
      "A requirement that specifies the system's response time."
    ],
    "correctOption": 0,
    "explanation": "A requirement that specifies the system's ability to function with different devices or platforms."
  },
  {
    "stem": "What is the main objective of the \"requirements analysis\" phase in a software project?",
    "options": [
      "Detailing the technical architecture of the system.",
      "Validating requirements with stakeholders to ensure they meet their needs.",
      "Coding the system based on the requirements.",
      "Testing the system to ensure it works correctly.",
      "Performing system design documentation."
    ],
    "correctOption": 1,
    "explanation": "Validating the requirements with stakeholders to ensure they meet their needs."
  },
  {
    "stem": "What does it mean to \"validate requirements\"?",
    "options": [
      "Checking if the requirements are technically correct and ready to be implemented.",
      "Confirming that the requirements meet customer needs and are free from ambiguities.",
      "Ensuring that all requirements will be met without failures during development.",
      "Ensuring that requirements are delivered on time.",
      "Assessing the feasibility of requirements based on the source code."
    ],
    "correctOption": 1,
    "explanation": "Confirming that the requirements meet customer needs and are free from ambiguities."
  },
  {
    "stem": "What are \"critical requirements\" in a software project?",
    "options": [
      "Requirements that describe aspects of security, performance, and system reliability.",
      "Requirements that are of low priority and can be overlooked.",
      "Requirements that are irrelevant to the customer, but necessary for the developer.",
      "Requirements that describe the basic functionalities of the system.",
      "Requirements that concern user interface design."
    ],
    "correctOption": 0,
    "explanation": "Requirements that describe aspects of security, performance, and system reliability."
  },
  {
    "stem": "In Requirements Engineering, what is a \"technical requirement\"?",
    "options": [
      "A requirement related to system functionality.",
      "A requirement that describes technical specifications, such as the architecture or technologies to be used.",
      "A requirement that describes the system's response time.",
      "A requirement that defines the system's interactions with the customer.",
      "A requirement related to user interface design."
    ],
    "correctOption": 1,
    "explanation": "A requirement that describes technical specifications, such as the architecture or technologies to be used."
  },
  {
    "stem": "What is the role of the \"requirements management tool\" in a software project?",
    "options": [
      "Helping with source code documentation and version control.",
      "Facilitating the tracking of requirements, changes, and the relationship between them, helping communication between teams.",
      "Controlling project costs and necessary resources.",
      "Ensuring that all tests are executed automatically.",
      "Monitoring system performance after implementation."
    ],
    "correctOption": 1,
    "explanation": "Facilitating the tracking of requirements, changes, and the relationship between them, helping communication between teams."
  },
  {
    "stem": "What is the \"interview technique\" for requirements elicitation?",
    "options": [
      "A system design technique that describes how the software should be developed.",
      "A requirement collection technique where stakeholders are interviewed to understand their needs.",
      "A technique used to code requirements into the software.",
      "A technique for validating requirements with stakeholders.",
      "A technique for analyzing the system source code."
    ],
    "correctOption": 1,
    "explanation": "A requirement collection technique where stakeholders are interviewed to understand their needs."
  },
  {
    "stem": "What characterizes a \"performance requirement\"?",
    "options": [
      "A requirement that describes the system user interface.",
      "A requirement that describes the system's response time and processing capacity.",
      "A requirement that specifies user access permissions.",
      "A requirement that defines the database structure.",
      "A requirement that describes system security."
    ],
    "correctOption": 1,
    "explanation": "A requirement that describes the system's response time and processing capacity."
  },
  {
    "stem": "What is the main function of a \"use case\" in Requirements Engineering?",
    "options": [
      "Describing how the system should be implemented in the source code.",
      "Documenting user interactions with the system to ensure functional requirements are met.",
      "Detailing the system's technical architecture.",
      "Defining the user interface design.",
      "Describing system performance."
    ],
    "correctOption": 1,
    "explanation": "Documenting user interactions with the system to ensure functional requirements are met."
  },
  {
    "stem": "What is a \"context diagram\" in Requirements Engineering?",
    "options": [
      "A diagram that describes the system architecture in detail.",
      "A diagram that shows the system's interactions with its external actors, such as users and other systems.",
      "A diagram that describes data flows between different system modules.",
      "A diagram used to define the system's non-functional requirements.",
      "A diagram that describes the hardware configuration required for the system."
    ],
    "correctOption": 1,
    "explanation": "A diagram that shows the system's interactions with its external actors, such as users and other systems."
  },
  {
    "stem": "What characterizes the \"maintainability\" of requirements in a system?",
    "options": [
      "The ability to update and modify requirements throughout the project lifecycle, without major impacts.",
      "The ability to document requirements in detail, without modifications.",
      "The ability to ensure that requirements will never need to be changed.",
      "The ability to implement requirements without interfering with system performance.",
      "The ability to test requirements with stakeholders without changes."
    ],
    "correctOption": 0,
    "explanation": "The ability to update and modify requirements throughout the project lifecycle, without major impacts."
  },
  {
    "stem": "What is an \"efficient requirements documentation\"?",
    "options": [
      "A documentation that describes all aspects of the system, including technical and design details.",
      "A clear, concise, and understandable documentation, which describes all necessary requirements accurately.",
      "A documentation focused only on system performance requirements.",
      "A detailed documentation that includes source code implementation.",
      "A documentation that defines system access permissions."
    ],
    "correctOption": 1,
    "explanation": "A clear, concise, and understandable documentation, which describes all necessary requirements accurately."
  },
  {
    "stem": "What are \"explicit requirements\"?",
    "options": [
      "Requirements that are not documented, but assumed.",
      "Requirements that are clearly defined and documented, without ambiguity.",
      "Requirements that are vague and can be interpreted in various ways.",
      "Requirements that have no impact on system design.",
      "Requirements that describe interactions between users and the system."
    ],
    "correctOption": 1,
    "explanation": "Requirements that are clearly defined and documented, without ambiguity."
  },
  {
    "stem": "What does \"fitness for use\" mean in terms of requirements quality?",
    "options": [
      "The ability of a requirement to be understood only by the development team.",
      "The ability of the requirement to be technically validated without considering the customer's perspective.",
      "The ability of a requirement to correctly meet customer needs or objectives and be applicable in the context of use.",
      "The ability of the requirement to be validated only by a group of stakeholders.",
      "The ability of the requirement to be written in a technical and precise language."
    ],
    "correctOption": 2,
    "explanation": "The ability of a requirement to correctly meet customer needs or objectives and be applicable in the context of use."
  },
  {
    "stem": "What is the role of a requirements analyst in a software project?",
    "options": [
      "Defining and implementing all system test cases.",
      "Eliciting customer needs and translating them into understandable requirements for the development team.",
      "Creating system prototypes and ensuring that the software is visually appealing.",
      "Designing the system architecture without considering customer needs.",
      "Managing communication between developers and software tests."
    ],
    "correctOption": 1,
    "explanation": "Eliciting customer needs and translating them into understandable requirements for the development team."
  },
  {
    "stem": "How does Requirements Engineering relate to system implementation?",
    "options": [
      "Requirements Engineering only defines functionalities, while implementation is the exclusive responsibility of the development team.",
      "Requirements Engineering is completely separate from implementation, as it focuses only on documentation.",
      "Requirements Engineering provides the necessary foundation for the development team to understand customer needs and implement the solution in alignment with the requirements.",
      "Requirements Engineering focuses only on system behavior, without considering how it will be implemented.",
      "Requirements Engineering defines the software's technical architecture and does not need to interact with the implementation team."
    ],
    "correctOption": 2,
    "explanation": "Requirements Engineering provides the necessary foundation for the development team to understand customer needs and implement the solution in alignment with the requirements."
  },
  {
    "stem": "What is a \"non-functional requirement\"?",
    "options": [
      "A requirement that defines system functionality.",
      "A requirement that describes system behavior in terms of usability, performance, security, among others.",
      "A requirement that addresses hardware and network needs for the system.",
      "A requirement that is only relevant for the testing phase.",
      "A requirement that describes the interaction between users and the system."
    ],
    "correctOption": 1,
    "explanation": "A requirement that describes system behavior in terms of usability, performance, security, among others."
  },
  {
    "stem": "What is the relationship between Requirements Engineering and the Capability Maturity Model Integration (CMMI)?",
    "options": [
      "Requirements Engineering does not apply to CMMI, as the model focuses only on software implementation.",
      "Requirements Engineering is linked to two areas of CMMI: Requirements Development (RD) and Requirements Management (REQM), which ensure the evolution and maintenance of requirements throughout the software lifecycle.",
      "CMMI replaces Requirements Engineering, focusing only on continuous software improvement.",
      "Requirements Engineering in CMMI is limited to documenting requirements, without involving the development team.",
      "CMMI provides guidelines only for the testing and implementation phases of software, without considering Requirements Engineering."
    ],
    "correctOption": 1,
    "explanation": "Requirements Engineering is linked to two areas of CMMI: Requirements Development (RD) and Requirements Management (REQM), which ensure the evolution and maintenance of requirements throughout the software lifecycle."
  },
  {
    "stem": "What characterizes a \"modifiable\" requirements specification?",
    "options": [
      "When it is detailed enough to cover all system situations.",
      "When it can be changed throughout development, in response to changes in customer needs or alterations in the project environment.",
      "When it does not need to be changed after the initial definition.",
      "When it is completely stable and immutable after initial approval.",
      "When it is restricted to a fixed set of requirements."
    ],
    "correctOption": 1,
    "explanation": "When it can be changed throughout development, in response to changes in customer needs or alterations in the project environment."
  },
  {
    "stem": "When is it most appropriate to apply a detailed requirements specification?",
    "options": [
      "When the project involves a high degree of uncertainty and frequent changes in requirements.",
      "When the project team has little experience with the customer's domain.",
      "When the system will be developed in an agile manner, with quick iterations and continuous adjustments.",
      "When development is done by dispersed teams and face-to-face communication is limited.",
      "When the customer is not involved in the project."
    ],
    "correctOption": 3,
    "explanation": "When development is done by dispersed teams and face-to-face communication is limited."
  },
  {
    "stem": "What characterizes a \"functional requirement\" in a software project?",
    "options": [
      "A requirement related to system performance.",
      "A requirement that describes the services or functions the system must provide to its users.",
      "A requirement that defines system security parameters.",
      "A requirement that specifies the system's hardware interfaces.",
      "A requirement that describes the database structure."
    ],
    "correctOption": 1,
    "explanation": "A requirement that describes the services or functions that the system must provide to its users."
  },
  {
    "stem": "What is the main responsibility of the requirements analyst?",
    "options": [
      "Developing the software source code.",
      "Defining system functionalities without consulting the customer.",
      "Eliciting, documenting, validating, and managing requirements, ensuring they meet customer needs.",
      "Managing the software project schedule.",
      "Testing the software during development."
    ],
    "correctOption": 2,
    "explanation": "Eliciting, documenting, validating, and managing requirements, ensuring they meet customer needs."
  },
  {
    "stem": "In the Requirements Engineering process, what is the importance of validating requirements with stakeholders?",
    "options": [
      "Ensuring that all requirements are correctly documented.",
      "Avoiding changes in the project after implementation.",
      "Ensuring that the requirements meet the real needs and expectations of the customer and users.",
      "Ensuring that the requirements are implemented without changes.",
      "Defining the system architecture without consulting stakeholders."
    ],
    "correctOption": 2,
    "explanation": "Ensuring that the requirements meet the real needs and expectations of the customer and users."
  },
  {
    "stem": "What characterizes a \"non-functional\" requirement?",
    "options": [
      "A requirement that describes how the system should be structured.",
      "A requirement that describes system behavior in terms of usability, performance, security, etc.",
      "A requirement that describes system behaviors, such as login and logout.",
      "A requirement that defines data flows in the system.",
      "A requirement that describes database characteristics."
    ],
    "correctOption": 1,
    "explanation": "A requirement that describes system behavior in terms of usability, performance, security, etc."
  },
  {
    "stem": "What is the \"Product Backlog\" in agile methodologies?",
    "options": [
      "A list of all project requirements, ordered by importance.",
      "A set of system test cases.",
      "A system architecture model.",
      "A detailed schedule of all development activities.",
      "A set of errors found during development."
    ],
    "correctOption": 0,
    "explanation": "A list of all project requirements, ordered by importance."
  },
  {
    "stem": "What does \"requirements traceability\" mean?",
    "options": [
      "The ability to associate requirements with corresponding test cases.",
      "The ability to map requirements to implemented system functionalities.",
      "The ability to associate requirements with design decisions made by the development team.",
      "The ability to check if requirements meet quality standards.",
      "All of the above alternatives."
    ],
    "correctOption": 4,
    "explanation": "All of the above alternatives."
  },
  {
    "stem": "What is the main characteristic of a well-documented requirement?",
    "options": [
      "Clarity and specificity to avoid ambiguity.",
      "Excessive detailing of all system aspects.",
      "Focusing only on technical implementation and functionalities.",
      "Vague description to allow flexibility in design.",
      "Not containing references to the customer or stakeholders."
    ],
    "correctOption": 0,
    "explanation": "Clarity and specificity to avoid ambiguity."
  },
  {
    "stem": "In a software project, what does the \"fitness for use\" of a requirement mean?",
    "options": [
      "The ability of the requirement to be understood by all team members.",
      "The ability of the requirement to meet customer needs and objectives effectively and efficiently.",
      "The ability of the requirement to be practically tested in the system.",
      "The ability to modify the requirement as development progresses.",
      "The ability of a requirement to be applied exclusively in the final software."
    ],
    "correctOption": 1,
    "explanation": "The ability of the requirement to meet customer needs and objectives effectively and efficiently."
  },
  {
    "stem": "Which of the following options is an example of a \"requirements constraint\"?",
    "options": [
      "The system must allow user registration.",
      "The system must be capable of operating on different platforms, such as Windows and Linux.",
      "The system must be fast in generating reports.",
      "The system must be modular and scalable.",
      "The system must allow integration with other software platforms."
    ],
    "correctOption": 1,
    "explanation": "The system must be capable of operating on different platforms, such as Windows and Linux."
  },
  {
    "stem": "What is the main difference between \"business requirement\" and \"technical requirement\"?",
    "options": [
      "The business requirement describes system behavior, while the technical requirement describes hardware requirements.",
      "The technical requirement focuses on system performance aspects, while the business requirement describes what the system must do.",
      "The business requirement describes system functions, while the technical requirement describes design and architecture.",
      "There is no difference between them, both refer to technical documentation.",
      "The business requirement is detailed while the technical requirement is more generic."
    ],
    "correctOption": 2,
    "explanation": "The business requirement describes system functions, while the technical requirement describes design and architecture."
  },
  {
    "stem": "What is a \"correct requirements specification\"?",
    "options": [
      "When the requirements are well-detailed and specified, even if they do not meet the business objective.",
      "When each specified requirement helps satisfy a legitimate business need.",
      "When the specification is in compliance with the technical standard, without considering customer needs.",
      "When the requirements specification is only validated by the development team.",
      "When the requirements are described with high complexity, ensuring technical precision."
    ],
    "correctOption": 1,
    "explanation": "When each specified requirement helps satisfy a legitimate business need."
  },
  {
    "stem": "What is the role of the \"requirements specification\" in communication with the customer?",
    "options": [
      "It serves to document technical aspects that customers do not need to understand.",
      "It helps to clearly define what will be delivered, allowing customers to review and validate the product.",
      "It is an internal document, used exclusively by the development team.",
      "It serves as a rigid contract, with no possibility of changes after approval.",
      "It exclusively defines the design aspects of the system."
    ],
    "correctOption": 1,
    "explanation": "It helps to clearly define what will be delivered, allowing customers to review and validate the product."
  },
  {
    "stem": "What is \"requirements verification\"?",
    "options": [
      "The assessment of source code implementation to ensure that requirements are met.",
      "The confirmation that documented requirements are technically feasible and meet established standards.",
      "The process of testing the software to ensure it works correctly.",
      "The confirmation that all requirements meet business objectives and are complete.",
      "The process of ensuring that tests are performed based on documented requirements."
    ],
    "correctOption": 1,
    "explanation": "The confirmation that documented requirements are technically feasible and meet established standards."
  },
  {
    "stem": "What is the difference between \"complete\" and \"partial\" requirements?",
    "options": [
      "Complete requirements cover all aspects of the system, while partial requirements describe only a part of the system.",
      "Complete requirements include all necessary tests, while partial requirements do not.",
      "Complete requirements refer only to functionalities, while partial requirements are more detailed and technical.",
      "There is no difference between them.",
      "Complete requirements have a greater focus on performance, while partial requirements address security issues."
    ],
    "correctOption": 0,
    "explanation": "Complete requirements cover all aspects of the system, while partial requirements describe only a part of the system."
  },
  {
    "stem": "How do \"system models\" help in requirements specification?",
    "options": [
      "They detail the system architecture and how it should be implemented.",
      "They help illustrate the relationships between system components and interactions with the external environment.",
      "They are used only for source code implementation.",
      "They serve to define system design patterns, without considering requirements.",
      "They detail the hardware functions and characteristics of the system."
    ],
    "correctOption": 1,
    "explanation": "They help illustrate the relationships between system components and interactions with the external environment."
  },
  {
    "stem": "What is a \"user story\" in agile methodologies?",
    "options": [
      "A technical description of how the system will be implemented.",
      "A simple and short way to describe a user need, focusing on the value delivered.",
      "A set of detailed technical requirements.",
      "A visual representation of the system with all use cases.",
      "A list of all necessary functionalities for the system."
    ],
    "correctOption": 1,
    "explanation": "A simple and short way to describe a user need, focusing on the value delivered."
  },
  {
    "stem": "What is the importance of ensuring that requirements are \"verifiable\"?",
    "options": [
      "It ensures that requirements can be transformed into code without the need for tests.",
      "It allows ensuring that the system is delivered within the established budget and deadline.",
      "It allows requirements to be tested and validated, ensuring that the system meets stakeholder needs.",
      "It ensures that requirements are only met in the testing phase.",
      "It ensures that requirements are always in compliance with best development practices."
    ],
    "correctOption": 2,
    "explanation": "It allows requirements to be tested and validated, ensuring that the system meets stakeholder needs."
  },
  {
    "stem": "What does \"fitness for use\" of a requirement mean?",
    "options": [
      "The ability of the requirement to be technically implemented without problems.",
      "The ability of the requirement to meet customer needs and objectives effectively.",
      "The ability of a requirement to be documented without ambiguities.",
      "The ability of a requirement to be easily adapted throughout development.",
      "The ability of a requirement to be implemented without changes throughout the project."
    ],
    "correctOption": 1,
    "explanation": "The ability of the requirement to meet customer needs and objectives effectively."
  },
  {
    "stem": "When should requirements definition begin in a software project?",
    "options": [
      "During the project testing phase.",
      "As soon as code implementation begins.",
      "In the requirements elicitation phase, before the start of design and development.",
      "When the development team finalizes the system architecture.",
      "During the transition of the software to the production environment."
    ],
    "correctOption": 2,
    "explanation": "In the requirements elicitation phase, before the start of design and development."
  },
  {
    "stem": "What is the function of the \"glossary\" in a requirements specification?",
    "options": [
      "Defining the technical terms and acronyms used throughout the specification, to ensure that all involved parties understand them in the same way.",
      "Listing all desired functionalities for the system.",
      "Describing system behavior under different scenarios.",
      "Defining the technical and hardware constraints of the system.",
      "Creating data flow and process diagrams."
    ],
    "correctOption": 0,
    "explanation": "Defining the technical terms and acronyms used throughout the specification, to ensure that all involved parties understand them in the same way."
  },
  {
    "stem": "What is a \"security requirement\" in a software system?",
    "options": [
      "A requirement that describes the system functionalities.",
      "A requirement that specifies user access permissions to the system.",
      "A requirement related to system performance.",
      "A requirement that describes the data backup process.",
      "A requirement that defines the system response time."
    ],
    "correctOption": 1,
    "explanation": "A requirement that specifies user access permissions to the system."
  },
  {
    "stem": "What characterizes a \"non-functional requirement\" related to performance?",
    "options": [
      "A requirement that describes how the system should interact with users.",
      "A requirement that defines the response times or the system's ability to process data.",
      "A requirement related to user interface design.",
      "A requirement related to the programming language to be used.",
      "A requirement that describes the technical architecture of the system."
    ],
    "correctOption": 1,
    "explanation": "A requirement that defines the response times or the system's ability to process data."
  },
  {
    "stem": "What is the main advantage of using prototypes in Requirements Engineering?",
    "options": [
      "They help define requirements based on the source code.",
      "They allow visual validation of requirements and quick feedback from stakeholders.",
      "They are used to optimize system performance.",
      "They replace detailed requirements documentation.",
      "They ensure that all requirements are implemented without failures."
    ],
    "correctOption": 1,
    "explanation": "They allow visual validation of requirements and quick feedback from stakeholders."
  },
  {
    "stem": "What characterizes a \"functional requirement\" in a software project?",
    "options": [
      "A requirement that describes system behavior in error situations.",
      "A requirement that defines how the system should be configured to work on different platforms.",
      "A requirement that describes the functionalities the system must provide to users.",
      "A requirement that describes system access permissions.",
      "A requirement that defines the hardware interfaces required for the system."
    ],
    "correctOption": 2,
    "explanation": "A requirement that describes the functionalities that the system must provide to users."
  },
  {
    "stem": "What should be avoided in requirements definition?",
    "options": [
      "Using precise and specific language.",
      "Defining requirements with an appropriate level of detail.",
      "Using ambiguous or vague terms that can be interpreted in different ways.",
      "Ensuring that requirements are easily modifiable during the project lifecycle.",
      "Documenting all requirements clearly and concisely."
    ],
    "correctOption": 2,
    "explanation": "Using ambiguous or vague terms that can be interpreted in different ways."
  },
  {
    "stem": "What is the difference between \"functional\" and \"non-functional\" requirements?",
    "options": [
      "Functional requirements describe system behavior, while non-functional requirements describe aspects such as performance, security, and usability.",
      "Functional requirements are related to design, while non-functional requirements describe hardware needs.",
      "Functional requirements define use cases, while non-functional requirements deal with system architecture.",
      "Functional requirements are more important than non-functional requirements.",
      "There is no difference between functional and non-functional requirements."
    ],
    "correctOption": 0,
    "explanation": "Functional requirements describe system behavior, while non-functional requirements describe aspects such as performance, security, and usability."
  },
  {
    "stem": "What is \"agile requirements engineering\"?",
    "options": [
      "A set of rigid processes for documenting all requirements before the start of development.",
      "A development approach that prioritizes detailed documentation of all requirements, without changes during the project lifecycle.",
      "An approach that emphasizes constant communication with the customer and continuous adaptation of requirements throughout development.",
      "A methodology that focuses only on implementing system functionalities.",
      "An approach that eliminates any form of requirements documentation."
    ],
    "correctOption": 2,
    "explanation": "An approach that emphasizes constant communication with the customer and continuous adaptation of requirements throughout development."
  },
  {
    "stem": "What does \"completeness\" mean in requirements specification?",
    "options": [
      "When all requirements are described without omissions, and cover all aspects of the system.",
      "When functional and non-functional requirements are documented separately.",
      "When documentation is detailed, but without including system constraints.",
      "When requirements are described vaguely and open to interpretations.",
      "When all requirements are validated by the customer, but not tested."
    ],
    "correctOption": 0,
    "explanation": "When all requirements are described without omissions, and cover all aspects of the system."
  },
  {
    "stem": "What is \"requirements specification\" in Requirements Engineering?",
    "options": [
      "A document that describes system behavior, its functionalities, and the requirements that must be met.",
      "A set of source codes that implement system functionalities.",
      "A document that defines the system's technical architecture.",
      "A test plan that defines the steps to validate the system.",
      "A description of the system's user interface."
    ],
    "correctOption": 0,
    "explanation": "A document that describes system behavior, its functionalities, and the requirements that must be met."
  },
  {
    "stem": "What is the \"requirements elicitation phase\" in a software project?",
    "options": [
      "The phase where developers start coding the system.",
      "The phase where requirements are validated by customers and stakeholders.",
      "The phase where requirements are identified, collected, and documented from stakeholders.",
      "The system performance testing phase.",
      "The phase where documentation is delivered to the customer."
    ],
    "correctOption": 2,
    "explanation": "The phase where requirements are identified, collected, and documented from stakeholders."
  },
  {
    "stem": "What does \"verifiability\" of requirements mean?",
    "options": [
      "The ability to ensure that requirements are implemented without failures.",
      "The ability to confirm whether requirements can be tested and validated objectively.",
      "The ability to ensure that requirements are in accordance with source code specifications.",
      "The ability to ensure that requirements meet customer needs.",
      "The ability to implement requirements efficiently."
    ],
    "correctOption": 1,
    "explanation": "The ability to confirm whether requirements can be tested and validated objectively."
  },
  {
    "stem": "What is the main advantage of keeping requirements updated during the project lifecycle?",
    "options": [
      "It allows requirements to be implemented without changes in system design.",
      "It ensures that all requirements are met in the same way throughout development.",
      "It allows the system to adapt to changes in customer needs and ensures the relevance of requirements.",
      "It ensures that requirements are documented clearly and precisely from the beginning.",
      "It eliminates the need for requirements review."
    ],
    "correctOption": 2,
    "explanation": "It allows the system to adapt to changes in customer needs and ensures the relevance of requirements."
  },
  {
    "stem": "What characterizes a \"clear\" requirements specification?",
    "options": [
      "When requirements are described vaguely, allowing flexibility in implementation.",
      "When requirements are defined without taking into account changes in the business environment.",
      "When requirements are described precisely, without ambiguity, to avoid different interpretations.",
      "When requirements are described with many technical details, hindering understanding.",
      "When requirements are exclusively based on the experience of the development team."
    ],
    "correctOption": 2,
    "explanation": "When requirements are described precisely, without ambiguity, to avoid different interpretations."
  },
  {
    "stem": "What is the role of \"requirements verification\" in Requirements Engineering?",
    "options": [
      "Ensuring that requirements are tested and validated during the development phase.",
      "Confirming that requirements meet customer needs and are free from errors or ambiguities.",
      "Certifying that all requirements have been implemented in the source code.",
      "Validating that all functional requirements are documented.",
      "Ensuring that requirements meet system performance standards."
    ],
    "correctOption": 1,
    "explanation": "Confirming that requirements meet customer needs and are free from errors or ambiguities."
  },
  {
    "stem": "What characterizes a \"performance requirement\" in a software system?",
    "options": [
      "A requirement related to system architecture and design.",
      "A requirement that describes how the system should be secure.",
      "A requirement that defines the response time or the system's processing capacity.",
      "A requirement related to system usability and accessibility.",
      "A requirement that describes the system's interactions with users."
    ],
    "correctOption": 2,
    "explanation": "A requirement that defines the response time or the system's processing capacity."
  }
]